[{"text": "U.S. restarts nuclear diplomacy with Iran amid escalating threats. Here's what to know | PBS News\nSupport PBS News\nYour generous monthly contribution— or whatever you can give—will help secure our future.\nDonate now\nClose Popup\nPBS News\nU.S. restarts nuclear diplomacy with Iran amid escalating threats. Here's what to know\nFeb 6, 2026 6:55 PM EST\nBy —\nNick Schifrin\nNick Schifrin\nBy —\nDan Sagalyn\nDan Sagalyn\nBy —\nZeba Warsi\nZeba Warsi\nLeave your feedback\nShare\nCopy URL\nhttps://www.pbs.org/newshour/show/u-s-restarts-nuclear-diplomacy-with-iran-amid-escalating-threats-heres-what-to-know\nEmail\nFacebook\nTwitter\nLinkedIn\nPinterest\nTumblr\nShare on Facebook\nShare on Twitter\nTranscript\nAudio\nThe U.S. faced two very different nuclear challenges across two continents Friday. For the first time since last year’s war with Iran, U.S. and Iranian diplomats restarted indirect talks over Tehran’s nuclear program. And for the first time, the U.S. accused China of conducting a secret nuclear test, just one day after letting a key nuclear arms treaty with Russia expire. Nick Schifrin reports.\nRead the Full Transcript\nNotice: Transcripts are machine and human generated and lightly edited for accuracy. They may contain errors.\nGeoff Bennett:\nWelcome to the \"News Hour.\" Today, across two continents, the U.S. confronted two very different nuclear challenges. For the first time since last year's war in Iran, U.S. and Iranian diplomats restarted diplomacy focused on that country's nuclear program.\nAmna Nawaz:\nAnd for the first time today, the U.S. accused China of conducting a secret nuclear test just one day after letting the final nuclear arms control treaty with Russia expire, Nick Schifrin been covering both stories and joins us now. So, Nick, let's start with the U.S. and Iran. What do we know about how those talks went today?\nNick Schifrin:\nWell, the Trump administration has provided no readout at the moment, but in the lead-up to these talks, we heard from Secretary of State Marco Rubio and the top negotiator, Steve Witkoff, that Iran must not make any nuclear fuel domestically, must restrict the range of its ballistic missiles, must end its support for proxy groups and account for highly enriched uranium that has been missing since last summer's strikes. Today, the U.S. held indirect talks. You see Witkoff there with the president's son-in-law, Jared Kushner, meeting Oman's foreign minister, who then met with Iran's foreign minister, Abbas Araghchi, who said the talks focused on nuclear weapons and were a -- quote -- \"good start.\"\nAbbas Araghchi, Iranian Foreign Minister:\nWe were able to exchange our viewpoints, to express our concerns and our interests for a possible deal between the two sides on our nuclear question.\nNick Schifrin:\nAraghchi said there would be a new round of talks. No confirmation of that from the U.S. side, which for the first time included the top U.S. military commander from the Middle East, a reminder, Amna, of President Trump's threats against Iran and that military buildup still in the region.\nAmna Nawaz:\nSo what do the experts tell you all of that means for the possibility of an actual deal?\nNick Schifrin:\nWell, that's the question I put to Karim Sadjadpour of the Carnegie Endowment for International Peace. He is very skeptical of any deal of Iran's nuclear program, missile program, or support for proxies, including Hezbollah and Hamas. Karim Sadjadpour, Carnegie Endowment for International Peace: The Iranian regime still seems so intent on defying the United States and they fear that if they give into pressure, it's going to project weakness and invite even more pressure. Up until now Iran has shown no flexibility on moderating its ballistic missile program, or its regional proxies. And so the Iranian goal is to limit this conversation only to nuclear and even then to drag on the conversation.\nNick Schifrin:\nDrag on the conversation, Amna, so it doesn't get bombed by the United States. A U.S. official, though, confirms to me that Iran is trying to reconstitute its ballistic missile program. Look at the before right there and now look at the after of a missile production facility. Listen to distinguished scholar at Middlebury College Jeffrey Lewis. He's studied these kinds of images for years.\nJeffrey Lewis, Middlebury College:\nWe can see those facilities in satellite images. And so Israel attempted to destroy many of those buildings, but now they're back. It seems pretty clearly that Iran is well on its way to resuming production of its missiles.\nNick Schifrin:\nAnd U.S. officials, Amna, acknowledge that could mean Israel, if not the U.S., try and strike those missile production factories again in 2026.\nAmna Nawaz:\nLet's turn now to those allegations, accusations of a secret nuclear test by China. What exactly is the U.S. saying happened?\nNick Schifrin:\nYes, so, for the first time today, the U.S. revealed that China conducted explosive nuclear tests, including in June 2020, and sought to conceal them by putting the explosion inside an underground chamber. That would be China's first explosive test in some 25 years. Now, former senior officials told me today that they have known about that test for years. So what's interesting perhaps mostly today is the timing. The fact that China conducted that test has not been declassified until today, which happens to be the day after the U.S. let New START, the final nuclear arms control treaty, expire. The Trump administration and some experts have long argued that New START wasn't adequate because it didn't address China's growing arsenal. And so today it seems to be an attempt to try and pressure China into some kind of three-way talks with the United States and Russia about arms control overall. But, honestly, Beijing has always resisted any kind of limits on its nuclear program while it's growing its arsenal, says Jeffrey Lewis.\nJeffrey Lewis:\nChina has largely resisted entering any kind of formal talks, partly because their number is lower than the U.S. and they're in the process of catching up. But I think at a deeper and more profound level, it's because all of the things we want, predictability, transparency, these are things that China thinks are bad for it, because China is worried that, if we find them to be predictable and transparent, that we will be more comfortable pushing them around in a regional security crisis because we will know where their red lines are.\nNick Schifrin:\nWhich means no trilateral talks with China any time soon. And, tonight, I spoke to former Biden senior officials and also Republican senior arms control officials, and both argued to me that the U.S. should deploy more nuclear warheads. And now that New START has expired, they can do exactly that.\nAmna Nawaz:\nNick Schifrin starting our coverage tonight. Nick, thank you.\nNick Schifrin:\nThank you.\nListen to this Segment\nWatch\nWatch the Full Episode\nPBS NewsHour from Feb 06, 2026\nRelated\nFeb 05\nWATCH: Trump 'wants to see' if an Iran deal can be made but is ready for other options, Leavitt says at White House briefing\nBy\nAssociated Press\nFeb 04\nWatch\n3:11\nExpiration of U.S.-Russia nuclear weapons treaty sparks concerns of new arms race\nBy\nNick Schifrin, Dan Sagalyn\nFeb 04\nAfter crushing protests, Iran's supreme leader now tries to avert a U.S. attack\nBy\nLee Keath, Associated Press\nGo Deeper\niran\niran nuclear program\nnuclear talks\nBy —\nNick Schifrin\nNick Schifrin\nNick Schifrin is PBS News Hour’s Foreign Affairs and Defense Correspondent and serves as the host of Compass Points from PBS News.\n@nickschifrin\nBy —\nDan Sagalyn\nDan Sagalyn\nAs the deputy senior producer for foreign affairs and defense at the PBS NewsHour, Dan plays a key role in helping oversee and produce the program’s foreign affairs and defense stories. His pieces have broken new ground on an array of military issues, exposing debates simmering outside the public eye.\n@DanSagalyn\nBy —\nZeba Warsi\nZeba Warsi\nZeba Warsi is a foreign affairs producer, based in Washington DC. She's a Columbia Journalism School graduate with an M.A. in Political journalism. She was one of the leading members of the NewsHour team that won the 2024 Peabody award for News for our coverage of the war in Gaza and Israel.\n@Zebaism\nSupport Provided By:\nLearn more\nMore Ways to Watch\nPBS Video\nPBS App\nYouTube\nFacebook\nEducate your inbox\nSubscribe to Here’s the Deal, our politics\nnewsletter for analysis you won’t find anywhere else.\nEnter your email address\nSubscribe\nForm error message goes here.\nThank you. Please check your inbox to confirm.", "metadata": {"source": "https://www.pbs.org/newshour/show/u-s-restarts-nuclear-diplomacy-with-iran-amid-escalating-threats-heres-what-to-know", "title": "U.S. restarts nuclear diplomacy with Iran amid escalating ..."}}, {"text": "Trump is beset by hard dilemmas and no easy wins with Iran | CNN Politics\nPolitics\n8 min read\nTrump is beset by hard dilemmas and no easy wins with Iran\nAnalysis by\nStephen Collinson\nUpdated Feb 6, 2026, 12:00 AM ET\nPublished Feb 6, 2026, 12:00 AM ET\nPUBLISHED\nFeb 6, 2026, 12:00 AM ET\nUS President Donald Trump speaks during the 74th annual National Prayer Breakfast at the Washington Hilton in Washington DC, on February 5, 2026.\nAlex Wong/Getty Images\nThe Middle East\nDonald Trump\nSouth America\nSee all topics\nFacebook\nTweet\nEmail\nLink\nLink Copied!\nFollow\nThis is one shock Donald Trump may prefer not to inflict on Americans.\nIf one day soon, they awake to a new war with Iran, the president will be taking a huge gamble in a nation starting to look exhausted by his extremes.\nPolls show\nvoters overwhelmingly worry about the economy and their struggles to afford food and housing.\nYet Trump opened the year concentrating on almost everything else. He’s toppled a Venezuelan dictator, sent federal agents on a deportation surge into Minnesota that killed two citizens — and is back\nmaligning the electoral system .\nAnd he is acquiring a taste for putting down a military hammer — he’s struck sites in Iran, Iraq, Yemen, Syria, Nigeria, Venezuela and alleged drug boats in the Pacific and the Caribbean during his first year back in office.\nThat’s one reason why his\nthreats to punish Iran\nfor cracking down on protesters and to prevent it ever reconstituting its nuclear program have teeth, as negotiations open Friday in Oman between officials from Washington and Tehran.\nBut with\napproval ratings\ndipping below 40%, in a midterm election year that already looks grim for Republicans, Trump must consider his ragged domestic standing alongside the hideously difficult military questions he’s facing on Iran.\nTrump believes his volatility widens his negotiating room. Yet amid a new Iran crisis, it’s getting harder to see how he emerges with the kind of crisp, easy win that he craves.\nThe president is convinced that Iran’s clerical leaders want to do a “deal” to avoid the possibility of war with the United States. He’s amassed a significant naval force in the region and has military options to inflict a grievous blow.\nThis buildup has added steel to hard-driving diplomacy.\nAnd the Iranians may not be able to rely on a TACO (Trump Always Chickens Out) moment. Trump’s global belligerence has enforced red lines. He took bold action to assassinate Iranian military and intelligence chief Qasem Soleimani in Iraq in his first term. In his second, he sent US stealth bombers on a daring round-the-world trip to pulverize Iran’s nuclear sites.\nTrump has also plunged into Iranian domestic politics more than any other 21st-century president, warning the clerical regime of reprisals for continued attacks on their own citizens, following a brutal crackdown last month that apparently killed thousands of people in cold blood.\nIn short, Trump has committed immense personal and geopolitical prestige to his latest test of wills with leaders in Tehran.\nWhy Iran is especially vulnerable\nIn this photo obtained by The Associated Press, Iranians attend an anti-government protest in Tehran, Iran, on January 9, 2026.\nUGC/AP\nIt might just make sense for Trump to charge through a rare opening: Iran has never been weaker in its 45-year showdown with the United States:\n• The revolutionary regime’s future is clouded by a succession crisis that is eroding its aura of permanence. The aged Ayatollah Ali Khamenei cannot go on forever.\n• Its crisis of political legitimacy has never been more extreme. Stark desperation and hopelessness drove protesters to the streets amid food and water shortages and grinding economic conditions.\n• And Iran’s regional proxies — including Hamas in Gaza and Hezbollah in Lebanon, which once offered an insurance policy against outside attack — have been devastated by wars with Israel.\nThis trio of factors create a logical rationale for US military action against Iran. There may be no better time for Washington to topple a regime that has haunted its Middle East policy, threatened its allies, and killed many Americans, both in terror attacks and through militias during the Iraq war.\nThe opening may not last long. And if Trump and Israeli Prime Minister Benjamin Netanyahu don’t take the shot now, they may regret a lost opportunity in years to come.\nIf Trump managed a feat beyond Presidents Carter, Reagan, Bush, Clinton, Bush, Obama and Biden by defeating one of America’s most sworn enemies, he’d earn a place in history that couldn’t be denied. Given the current president’s obsession with legacy, this must be a tantalizing prospect.\nIn an administration where the constraints on presidential action have all been removed, it may come down to Trump’s instincts.\n“The most important deliberations are those which are happening inside President Trump’s head,” Karim Sadjadpour, an Iran expert with the Carnegie Institute for International Peace, told CNN’s Becky Anderson on Monday.\n“I think if you look at his own precedent on three major occasions, he rolled the dice with Iran in 2018 — he left the nuclear deal. In 2020 he assassinated Iran’s top military commander, Qasem Soleimani. And of course, last June, he bombed their nuclear sites, and he believes that all these decisions were vindicated, and now Iran is weaker than it has been in the past because it doesn’t have any air defenses.”\nSadjadpour went on: “I think that context, coupled with the fact that Iran’s leadership continues to taunt him and added to the fact that there isn’t a grand bargain to be done, there is not a Nixon to China moment where you can get a great deal and normalize relations. And if he’s already said he obliterated Iran’s nuclear program last June, it’s unclear to me how getting another nuclear deal is going to be the outcome that he’s looking for here.”\nRisks of military action are higher than in Venezuela\nBut moving forward with military strikes would come with huge risks both in their execution and in the uncertain political conditions they may ensure.\nA serious attempt to either decapitate the Iranian regime or to devastate the military capacity of the Islamic Revolutionary Guards Corps and the Basij paramilitary militia would likely require a multi-day air campaign.\nAttempting to degrade Iran’s capacity to crush new protests would run the high risk of civilian losses given that much of machinery of repression is sited in civilian areas. Without the unthinkable prospect of a major ground invasion, how effective could such an effort be when the recent crackdown was carried out with brutal close-quarters street violence?\nIran, the seat of the ancient Persian civilization, is more contiguous and less plagued by sectarian divides than Iraq — which splintered after the US invasion in 2003. But no one wants to test the impact of a power vacuum if the government falls, in the absence of any clear path to a return to democracy.\nAnd the short, sharp thunderclap strike of the type Trump prefers and that doesn’t conflict with the no-foreign-quagmires mantra of his MAGA movement may not be sufficient to topple the clerical regime in Tehran.\nBut a longer military engagement with uncertain consequences would severely test Americans’ trust in their president. A war that went wrong could devastate Republicans in November’s already unpromising midterm elections.\nA sense of hubris has gathered around the White House since the toppling of Venezuelan leader Nicolás Maduro last month. But major US combat deaths in an Iranian war could effectively drain all the power and legitimacy from Trump’s second term.\nThere’ve also been signs in recent weeks that America’s Gulf allies — with whom Trump is close — fear the consequences of a US attack on Iran. Short-term missile strikes by Iran are possible. Tehran could try to cripple regional oil infrastructure. And long-term unrest could jolt a region now transitioning towards lucrative new horizons like AI and tourism.\nSome of Iran’s neighbors also fear chaos could ensue if Khamenei is killed because his country has known nothing but iron rule for more than 40 years. Another possibility is that the clerics could be succeeded by an equally brutal but more secular regime — that would seek to reconstitute its regional threat.\nIranian people wave national flags and hold up a portrait of Iran's Supreme Leader Ayatollah Ali Khamenei, while fireworks illuminate the sky during a pro-government religious rally in downtown Tehran, Iran, on February 4, 2026.\nMorteza Nikoubazl/NurPhotoGetty Images\nWhy diplomacy may not work either\nThis is all an argument for stepping back from the brink.\nBut after Trump’s weeks of threatening rhetoric, a decision not to strike Iran could drain international credibility the president amassed with the strikes on the nuclear sites last year and with the stunning raid into Venezuela.\nAnd doesn’t he also owe an obligation to Iran’s people as they dream of freedom?\nTrump’s predecessors avoiding encouraging a counter-revolution in Iran because they feared providing a pretext for even more fierce repression against demonstrators seen as US proxies. Trump had no such qualms and his vow that the US was “locked and loaded” to punish Tehran for its crackdowns conceivably brought more people onto the streets.\nIf the president doesn’t follow up, Iran’s leaders may be even less reticent to inflict horrendous violence on their citizens come the next uprising.\nGiven the complexity of the military equation, it’s obvious why the administration has not closed off a diplomatic exit ramp. But it’s hard to see any deal that the president will offer Iran that it will be prepared to accept — and vice versa.\nSecretary of State Marco Rubio laid out US goals ahead of the talks in Oman.\n“I’m not sure you can reach a deal with these guys, but we’re going to find out,” Rubio said. He made clear that the administration wants to focus on Iran’s nuclear program, but ", "metadata": {"source": "https://www.cnn.com/2026/02/06/politics/iran-us-negotiations-trump-analysis", "title": "Trump is beset by hard dilemmas and no easy wins with Iran"}}, {"text": "MSN", "metadata": {"source": "https://www.msn.com/en-us/news/politics/epstein-helped-fund-lavish-lifestyle-for-former-obama-wh-counsel/ar-AA1VmeUQ", "title": "Epstein helped fund lavish lifestyle for former Obama ... - MSN"}}, {"text": "As 'Sell America' market volatility rages on, look to your bonds Skip Navigation Markets Business Investing Tech Politics Video Watchlist Investing Club PRO Livestream Menu Key Points U.S. investors aren't abandoning U.S assets, but more money has been flowing to international markets, and not just stocks but emerging markets credit, among other fixed-income strategies.\nConcentration in U.S. equities, rising volatility, a weak dollar, and recent hot performance for asset classes like emerging markets bonds, are all pushing portfolios to become broader in holdings across both stocks and bonds. Trading experts appearing on this week's \"ETF Edge\" said big changes are in store for bond portfolios, whether in the U.S. or overseas holdings. watch now VIDEO 12:18 12:18 Fixed income will remain essential in portfolios this year, predicts BondBloxx's Joanna Gallegos ETF Edge Amid recent debate over the so-called\n\"Sell America\" trade\nand capital rotating out of U.S. markets, foreign\nstocks have received most of the attention . But international bonds, especially emerging market bonds, have also been riding high. \"The best performing area in fixed income year to date, and also last year, was emerging markets,\" said Joanna Gallegos, co-founder of fixed-income ETF company BondBloxx on this week's CNBC \"ETF Edge.\" As an example, the iShares JPMorgan USD Emerging Markets Bond ETF ( EMB ) generated over a 13% return in 2025. BondBloxx's JP Morgan USD Emerging Markets 1-10 Year Bond ETF ( XEMD ) had a similar 2025. Weakness in the\nU.S. dollar , concerns about the\nfiscal health of the U.S.\nat a time of high spending and deficits, and the investing impact of President\nTrump's foreign policy , plus the recent performance trends, are all contributing to more interest from investors to diversify internationally.\nBut for Gallegos, it start with the currency and performance chasing rather than a view that the U.S. is losing favor as a market. \"The dollar pressure is putting more of a view on non-U.S. assets,\" Gallegos said. \"I think people are just seeing the returns from last year and looking for a way to take advantage of those opportunities more so than anything else,\" she said. \"The U.S. trade is not going away,\" she added.\nStock Chart Icon Stock chart icon The performance of the iShares JPMorgan USD Emerging Markets Bond ETF versus the iShares Core US Aggregate Bond ETF over the past five years. Morningstar data\nfor the month of January backs up the view that U.S. investors are not abandoning the domestic market, whether it is stocks or bonds being debated and even as more assets move overseas.\nU.S. market ETFs brought in an estimated $156 billion of net inflows in January, which was the best January ever, according to Morningstar. But investors also added $51 billion in net positive flows to international equity ETFs, which was a monthly record for that category. And taxable bond ETFs popped, with $46 billion from investors in net inflows for the month, led by Vanguard Total Bond Market ETF ( BND ) and the Vanguard Intermediate-Term Corporate Bond ETF ( VCIT ). Despite\nfears about a private credit bubble , the U.S. continues to offer \"the strongest fixed income market,\" according to Gallegos, and \"the biggest opportunity set for the world to continue to invest in it.\" Investors are expanding their portfolios and adding new sources of return while keeping U.S. assets at the core. \"I think we still see resilient economy,\" Gallegos said, pointing to steady earnings and a strong corporate balance sheet. In the bond market, specifically, she said, \"the yield curve looks like it's steepening, behaving appropriately, with rates on the long end being higher than the rates on the shorter end.\"\nTodd Sohn, technical strategist at Strategas Securities, said on \"ETF Edge\" that the scale of potential change on the fixed-income side of the portfolio is even larger than what is happening with equity assets, but it is not necessarily an international-first story. Money market funds have dominated flows for the past few years, with\n\"trillion in assets\"\nsitting on the sidelines as cash accounts have generated decent returns with no risk. But as central bank interest rates begin to drift lower, Sohn says more capital will move into the credit markets and bonds. \"That money is going to get deployed to fixed-income products,\" he said. Gallegos says investors no longer need to stretch as far for yield. She highlighted investment-grade credit, and in particular, investors seizing the opportunity to move \"out on the rate spectrum to BBB,\" where yields are higher but default risk remains historically low. And she emphasized that bonds are no longer solely a defensive tool. \"Bonds are not just necessarily the safety part of your portfolio, but also the opportunity and the income set as well,\" Gallegos said. Top bond ETFs by assets Vanguard Total Bond Market ETF (BND) iShares Core U.S. Aggregate Bond ETF (AGG) Vanguard Total International Bond ETF (BNDX) iShares 0-3 Month Treasury Bond ETF (SGOV) Vanguard Intermediate-Term Corporate Bond ETF (VCIT) Source: VettaFi Fixed-income ETF provider BondBloxx questions private credit meltdown fears, sees space as sensible way to generate income Blair Bao watch now watch now VIDEO 06:56 The growth of private credit in ETF investing Dominic Chu watch now watch now VIDEO 12:18 Fixed income will remain essential in portfolios this year, predicts BondBloxx's Joanna Gallegos Dominic Chu Read More", "metadata": {"source": "https://www.cnbc.com/2026/02/07/sell-america-market-trade-fixed-income-international-bonds.html", "title": "As 'Sell America' market volatility rages on, look to your bonds"}}, {"text": "As ‘Sell America’ trade volatility rages on, some of the biggest changes may be in your bonds – FrankTrades.com | Stock Market News, Stock Options Flow, Dark Pool, Product Reviews & more!\nSkip to content\nNews\nAmid recent debate over the so-called\n“Sell America” trade\nand capital rotating out of U.S. markets, foreign\nstocks have received most of the attention . But international bonds, especially emerging market bonds, have also been riding high.\n“The best performing area in fixed income year to date, and also last year, was emerging markets,” said Joanna Gallegos, co-founder of fixed-income ETF company BondBloxx on this week’s CNBC “ETF Edge.”\nAs an example, the iShares JPMorgan USD Emerging Markets Bond ETF ( EMB ) generated over a 13% return in 2025. BondBloxx’s JP Morgan USD Emerging Markets 1-10 Year Bond ETF ( XEMD ) had a similar 2025.\nWeakness in the\nU.S. dollar , concerns about the\nfiscal health of the U.S.\nat a time of high spending and deficits, and the investing impact of President\nTrump’s foreign policy , plus the recent performance trends, are all contributing to more interest from investors to diversify internationally.\nBut for Gallegos, it start with the currency and performance chasing rather than a view that the U.S. is losing favor as a market. “The dollar pressure is putting more of a view on non-U.S. assets,” Gallegos said. “I think people are just seeing the returns from last year and looking for a way to take advantage of those opportunities more so than anything else,” she said. “The U.S. trade is not going away,” she added.\nStock Chart Icon Stock chart icon\nThe performance of the iShares JPMorgan USD Emerging Markets Bond ETF versus the iShares Core US Aggregate Bond ETF over the past five years.\nMorningstar data\nfor the month of January backs up the view that U.S. investors are not abandoning the domestic market, whether it is stocks or bonds being debated and even as more assets move overseas.\nU.S. market ETFs brought in an estimated $156 billion of net inflows in January, which was the best January ever, according to Morningstar. But investors also added $51 billion in net positive flows to international equity ETFs, which was a monthly record for that category. And taxable bond ETFs popped, with $46 billion from investors in net inflows for the month, led by Vanguard Total Bond Market ETF ( BND ) and the Vanguard Intermediate-Term Corporate Bond ETF ( VCIT ).\nDespite\nfears about a private credit bubble , the U.S. continues to offer “the strongest fixed income market,” according to Gallegos, and “the biggest opportunity set for the world to continue to invest in it.”\nInvestors are expanding their portfolios and adding new sources of return while keeping U.S. assets at the core. “I think we still see resilient economy,” Gallegos said, pointing to steady earnings and a strong corporate balance sheet. In the bond market, specifically, she said, “the yield curve looks like it’s steepening, behaving appropriately, with rates on the long end being higher than the rates on the shorter end.”\nTodd Sohn, technical strategist at Strategas Securities, said on “ETF Edge” that the scale of potential change on the fixed-income side of the portfolio is even larger than what is happening with equity assets, but it is not necessarily an international-first story. Money market funds have dominated flows for the past few years, with\n“trillion in assets”\nsitting on the sidelines as cash accounts have generated decent returns with no risk. But as central bank interest rates begin to drift lower, Sohn says more capital will move into the credit markets and bonds. “That money is going to get deployed to fixed-income products,” he said.\nGallegos says investors no longer need to stretch as far for yield. She highlighted investment-grade credit, and in particular, investors seizing the opportunity to move “out on the rate spectrum to BBB,” where yields are higher but default risk remains historically low. And she emphasized that bonds are no longer solely a defensive tool. “Bonds are not just necessarily the safety part of your portfolio, but also the opportunity and the income set as well,” Gallegos said.\nTop bond ETFs by assets\nVanguard Total Bond Market ETF (BND)\niShares Core U.S. Aggregate Bond ETF (AGG)\nVanguard Total International Bond ETF (BNDX)\niShares 0-3 Month Treasury Bond ETF (SGOV)\nVanguard Intermediate-Term Corporate Bond ETF (VCIT)\nSource: VettaFi\nShare this:\nShare on X (Opens in new window)\nX\nShare on X (Opens in new window)\nX\nShare on Facebook (Opens in new window)\nFacebook\nShare on Reddit (Opens in new window)\nReddit\nShare on LinkedIn (Opens in new window)\nLinkedIn\nLike this: Like\nLoading...\n%d", "metadata": {"source": "https://franktrades.com/2026/02/07/as-sell-america-trade-volatility-rages-on-some-of-the-biggest-changes-may-be-in-your-bonds/", "title": "As ‘Sell America’ trade volatility rages on, some of the ..."}}, {"text": "'Sell America' trade makes a comeback as U.S. stocks see biggest drop in months. Here's what investors need to know. | Morningstar\nBy Joseph Adinolfi\nThe S&P 500 is now in the red for 2026. The U.S. dollar and Treasurys sold off on Tuesday, too.\nPresident Donald Trump's latest round of tariff threats, aimed at pressuring Europe to back a U.S. bid for Greenland, is stoking market instability.\nThe \"Sell America\" trade made a comeback on Tuesday following President Donald Trump's latest tariff threats against European allies, giving investors a taste of the volatility that rocked global markets back in April.\nAfter a short-lived attempt at a recovery in late-morning trading, U.S. stocks moved lower in the afternoon as Trump doubled down during a White House press conference. The selling wasn't confined to stocks: Treasury yields jumped, touching their highest levels since the summer, while the U.S. dollar sold off. Nor was it limited to the U.S., with stocks and bonds around the world selling off on Tuesday while haven assets like gold and the Swiss franc (USDCHF) rallied.\nThe S&P 500 finished Tuesday in the red for 2026, the first time that has happened this year.\n\"'Sell America' is back in a new form,\" Gina Martin Adams, chief market strategist at HB Wealth, said during an interview with MarketWatch. \"We came into this year with the market complacent on the idea that trade-policy risk was a 2025 story. It's clearly something we will need to contend with in 2026.\"\nThe S&P 500 SPX was off by 143.15 points, or 2.1%, at 6,796.86, its biggest percentage-point drop since Oct. 10, Dow Jones Market Data showed.\nThe Nasdaq COMP was off by 561.07 points, or 2.4%, at 22,954.32. The Dow Jones Industrial Average DJIA was off by 870.74 points, or 1.8%, at 48,488.59, FactSet data showed. Big Tech stocks were hit particularly hard, with members of the \"Magnificent Seven\" group of megacap stocks shedding a combined $683 billion in market capitalization - the most in a single day since Oct. 10, when Trump escalated his trade rhetoric against China.\nThe Cboe Volatility Index VIX, better known as the VIX or Wall Street's \"fear gauge,\" was up by 26.7% at 20.09, finishing above its long-term average of around 19.5, FactSet data showed.\nThe ICE U.S. Dollar Index DXY, a measure of the dollar's value against a basket of rivals, was off by 0.8% at 98.57 in recent trading after touching its lowest level of 2026. Tuesday's slump erased much of the buck's advance since Christmas Eve.\n\"The market is going to pay attention to the dollar as the harbinger of risk,\" Martin Adams said. \"If the dollar is falling, it is viewed as the anti-U.S. trade.\"\nOver the weekend, Trump said he would slap 10% tariffs on imports from eight European countries beginning next month. He later threatened tariffs as high as 200% on French wine and other products after French President Emmanuel Macron rebuffed Trump's offer to join his Gaza peace board. Trump will speak at the World Economic Forum in Davos, Switzerland, on Wednesday. Some European lawmakers have urged the European Union to abandon a trade deal with the U.S. An emergency leaders' summit has been scheduled for Thursday to discuss potential retaliatory measures.\nSpeaking during a press conference at Davos earlier, Treasury Secretary Scott Bessent dismissed the reaction to Trump's latest tariff threats. \"I would say this is the same kind of hysteria that we heard on April 2nd,\" he said. He urged trade partners not to walk away from their deals with the U.S.\nYields on long-dated Treasury notes and bonds were moving higher, while the U.S. dollar was selling off. The yield on the 10-year Treasury note BX:TMUBMUSD10Y was up 6.4 basis points at 4.294%, according to FactSet data.\n\"I'm concerned on a lot of different levels that the president has pushed it way too far,\" Kent Engelke, chief economic strategist at Capitol Securities Management, said Tuesday morning.\nThe 30-year Treasury yield BX:TMUBMUSD30Y was up 8.1 basis points to 4.920%, the biggest one-day rise since July, Dow Jones Market Data showed. Engelke said he thinks the yield could \"very easily\" go up to 5%.\n'Today is a warning'\nWhile it is unusual for U.S. stocks, Treasurys and the dollar to all sell off at the same time, it does happen. Dow Jones Market Data showed 18 instances in 2025 when the S&P 500 and ICE dollar index finished lower while Treasury yields rose. Before Tuesday, the last time this happened was Dec. 1.\nRichard Farr, chief market strategist at Pivotus Partners, cautioned that investors shouldn't read too much into Tuesday's selloff. A feared migration away from U.S. assets didn't pan out in 2025, even after Trump surprised global investors with his \"liberation day\" tariffs in April.\nHowever, he warned that Trump's aggressive rhetoric toward Federal Reserve Chair Jerome Powell and Greenland risked undermining confidence in U.S. bonds and the dollar.\n\"Today is a warning,\" Farr told MarketWatch.\nOthers said there was more at play than just the revived threat of tariffs. Farzin Azarm, managing director of equities trading at Mizuho, said stretched positioning in hot stock-market trades like semiconductor names meant the market was primed for a pullback heading into Tuesday.\n\"I don't buy the tariff concerns. The market needed this,\" he said.\nThe reaction in markets has so far been modest compared with what investors experienced in April. Back then, the S&P 500 skidded right to the edge of bear-market territory before Trump announced a 90-day pause on his tariffs.\nInternationally, the European STOXX 50 XX:SX5P fell for a third day on Tuesday, adding to its losses from Monday's session. The Japanese Nikkei 225 JP:NIK and Hong Kong's Hang Seng Index (HK:11)each fell for a fourth straight day. The iShares MSCI Emerging Markets ETF EEM retreated as well, FactSet data showed.\nIn Japan, local government bonds were selling off hard. The yield on the Japanese 40-year bond BX:TMBMKJP-40Y surged to 4.215%, the highest yield ever recorded, according to FactSet. Bond yields move inversely to prices.\nThe selloff in Japanese bonds was adding to the pressure facing riskier assets like stocks on Tuesday, Lukman Otunuga, senior markets analyst at FXTM, said in commentary shared with MarketWatch.\nFresh tariff threats could undercut expectations for global economic growth to accelerate in 2026, Otunuga added.\nBitcoin (BTCUSD) retreated below $90,000 on Tuesday shortly after the U.S. equity market opened for business. Prices for the pioneering digital currency were down 3% at $90,323 in recent trading.\nGold and silver hit a fresh round of intraday record highs as investors flocked to the smoking-hot metals trade. Most-active gold futures (GC00) gained $170.40 per troy ounce, or 3.7%, to settle at $4,765.80 an ounce.\nJoy Wiltermuth contributed.\n-Joseph Adinolfi\nThis content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal.\n(END) Dow Jones Newswires\n01-20-26 1703ET\nCopyright (c) 2026 Dow Jones & Company, Inc.\nThe articles, information, and content displayed on this webpage may\ninclude materials prepared and provided by third parties. Such\nthird-party content is offered for informational purposes only and\nis not endorsed, reviewed, or verified by Morningstar.\nMorningstar makes no representations or warranties regarding the\naccuracy, completeness, timeliness, or reliability of any third-party\ncontent displayed on this site. The views and opinions expressed in\nthird-party content are those of the respective authors and do not\nnecessarily reflect the views of Morningstar, its affiliates, or employees.\nMorningstar is not responsible for any errors, omissions, or delays\nin this content, nor for any actions taken in reliance thereon.\nUsers are advised to exercise their own judgment and seek independent\nfinancial advice before making any decisions based on such content.\nThe third-party providers of this content are not affiliated with\nMorningstar, and their inclusion on this site does not imply any\nform of partnership, agency, or endorsement.\nWrapping up our coverage of the markets and the week.\nTom Lauricella\nFeb 7, 2026\nWhat investors need to know about the market’s wild ride.\nSarah Hansen and Rachel Schlueter\nFeb 6, 2026\nAfter shutdown-related delays, the January jobs and inflation reports will be released.\nFrank Lee\nFeb 6, 2026\nThe income-focused pick under Morningstar’s coverage had a big dividend increase.\nFrank Lee\nFeb 6, 2026\nThese 5 undervalued biotechnology stocks look attractive today.\nTori Brovet\nFeb 5, 2026\nXPO was the top-gaining stock of the week, while Molina and Gartner both fell more than 25%.\nRachel Schlueter\nFeb 6, 2026\nSponsor Center\nTransparency is how we protect the integrity of our work and keep empowering investors to achieve their goals and dreams.\nAnd we have unwavering standards for how we keep that integrity intact, from our research and data to our policies on\ncontent and your personal data.\nWe’d like to share more about how we work and what drives our day-to-day business.\nHow we make money\nWe sell different types of products and services to both investment professionals and individual investors.\nThese products and services are usually sold through license agreements or subscriptions. Our investment management\nbusiness generates asset-based fees, which are calculated as a percentage of assets under management.\nWe also sell both admissions and sponsorship packages for our investment conferences and advertising on our websites\nand newsletters.\nHow we use your personal data\nHow we use your information depends on the product and service that you use and your relationship with us. We may use it to:\nVerify your identity, personalize the content you receive, or create and administer your account.\nProvide specific products and services to you, such as portfolio management or data aggregation.\nDevelop and improve features of our offerings", "metadata": {"source": "https://www.morningstar.com/news/marketwatch/20260120305/sell-america-trade-makes-a-comeback-as-us-stocks-see-biggest-drop-in-months-heres-what-investors-need-to-know", "title": "'Sell America' trade makes a comeback as U.S. stocks see ..."}}, {"text": "President Trump Launches TrumpRx.gov, Delivering Massive, Immediate Savings to Millions of Americans – The White House\nArticles\nPresident Trump Launches TrumpRx.gov, Delivering Massive, Immediate Savings to Millions of Americans\nThe White House\nFebruary 6, 2026\nLast night, President Donald J. Trump officially unveiled\nTrumpRx.gov , a transformative new government platform that gives Americans direct access to dramatically lower prices on dozens of common, high-cost brand-name prescription drugs.\nSecured through landmark\nMost-Favored-Nation\npricing agreements with leading pharmaceutical manufacturers, these deals ensure Americans pay prices aligned with the lowest in other developed nations, ending decades of overpayment and delivering immediate relief.\nStarting today, American patients — especially the millions who face high out-of-pocket costs for medications not fully covered by insurance — can access\nsubstantially lower\nprices on dozens of essential drugs via\nTrumpRx.gov . As the Trump Administration pursues the best possible deals for the American people, additional high-cost medications will be added on a rolling basis.\nKey examples of the savings include:\nGLP-1 medications — among the highest-spend drugs in the U.S. — have dramatic price reductions on TrumpRx.gov.\nThe monthly prices of\nOzempic®\nand injectable\nWegovy®\ndrop from $1,028 and $1,349, respectively, to an average of $350 and as low as $199, depending on dosage.\nThe monthly price of the\nWegovy®\npill falls from $1,349 to as low as $149, depending on dosage.\nThe monthly price of\nZepbound®\nfalls from $1,088 to an average of $346 and as low as $299, depending on dosage.\nMillions of Americans struggling with infertility often pay for fertility treatments entirely out-of-pocket. Thanks to TrumpRx.gov, they stand to save an average of $2,000+ per cycle on common medications.\nThe price of\nGonal-F®\n— one of the most commonly-used fertility drugs — falls to as low as $168 per pen, depending on dosage.\nThe price of\nCetrotide®\n— another commonly used fertility drug — falls from $316 to $22.50.\nThe price of\nOvidrel®\nfalls from $251 to $84.\nThis launch marks only the beginning.\nThe Trump Administration will be onboarding additional companies that have Most-Favored-Nation agreements and is aggressively pursuing additional agreements to expand the platform — ultimately driving even greater savings for Americans on prescription drugs.\nFor Americans who obtain their prescriptions through insurance, President Trump calls on Congress to swiftly pass his\nGreat Healthcare Plan .\nThis comprehensive reform would codify the savings from the Most-Favored-Nation initiative, lower insurance premiums, hold big insurance companies accountable, maximize price transparency, and enable coverage of TrumpRx.gov purchases under health plans — ensuring every American benefits from these historic reductions in drug costs.", "metadata": {"source": "https://www.whitehouse.gov/articles/2026/02/president-trump-launches-trumprx-gov-delivering-massive-immediate-savings-to-millions-of-americans/", "title": "President Trump Launches TrumpRx.gov, Delivering Massive ..."}}, {"text": "TrumpRx: See the 43 drugs available on the Trump administration's new discounted drug site - CBS News\nWatch CBS News\nPresident Trump's new\nTrumpRx online platform\nis a key part of his plan to help lower drug costs for consumers, with some polls showing two-thirds of Americans report high health care costs as their  chief financial concern .  Here's what to know about TrumpRx, which launched Thursday and which the White House\nsaid\nin a fact sheet will provide \"immediate relief\" to patients across the U.S.   What is TrumpRx? The White House said\nTrumprx.gov  gives consumers \"direct access to dramatically lower prices\" on dozens of commonly used medications. The website doesn't let users buy drugs directly, but rather directs people to drugmakers' sites, where they can fill their prescriptions.  TrumpRx notes it only \"displays discounted drug pricing offers\" and does not sell medication directly to consumers.  \"It's a portal where someone can check if they can find a cheaper price, direct-to-consumer, from a drug manufacturer,\" Kaye Pestaina, vice president and director of KFF's patient and consumer protections program, told CBS News. \"It's not a storefront.\"  To purchase a discounted medication, TrumpRx tells users to follow the instructions for each drug offer on the platform. Who can use TrumpRx? Anyone can use TrumpRx, provided they have a prescription. For now, however, the platform doesn't accept insurance and is limited to patients who buy medications out of their own pocket.\n\"At this time, TrumpRx discounted pricing is only available for cash-paying patients,\" the platform notes. As a result, spending on drugs through TrumpRx won't count toward a consumer's insurance deductible. Still, cheaper, direct-to-consumer options could benefit uninsured Americans, people with high deductibles and patients whose medications aren't covered by their insurance.   \"You should not be buying drugs anymore, going forward, without at least checking to see if those medications are available at these discounted prices,\" Dr. Mehmet Oz, the administrator of the Centers for Medicare and Medicaid Services, said Thursday.\nBy contrast, Pestaina noted that consumers might also be able to find lower drug prices through their own health insurance. \"It might be a good thing for some people, but for most folks they are paying less through insurance,\" she said. Exceptions to that might include GLP-1 medications for weight loss, where TrumpRX could lead to savings, Pestaina noted. \"Your employer might not cover these kinds of drugs, or there could be limitations.\" For example, the White House fact sheet said TrumpRx offers\nNovo Nordisk's Wegovy\npills for as little as $149 a month, down from $1,349. Consumers can also realize major savings on drugs used to treat infertility, according to the Trump administration.  Mr. Trump has urged Congress to pass\n\"The Great Healthcare Plan,\"\nwhich he introduced in January to lower health insurance costs. The proposal would \"enable coverage of TrumpRx.gov purchases under health plans\" and reduce medical insurance costs, according to the White House. What drugs are offered?  Consumers can currently access\n43 different drugs  through TrumpRx for a range of conditions. For instance, users seeking fertility drugs can get an 83% discount on Gonal F, a medication containing a follicle-stimulating hormone, according to the platform.  \"Fertility drug pricing could benefit a lot of people, because they aren't typically covered by insurance, and TrumpRx offers discounts,\" Merith Basey, CEO of Patients for Affordable Drugs Now, a patient advocacy group, told CBS News. Late last year, the White House\nstruck deals\nwith more than a dozen drugmakers to participate in the coupon-like program, including AstraZeneca, Eli Lilly Genentech, Merck, Pfizer, and others.\nThe White House said it plans to strike deals with more drugmakers, expanding the list of discounted drugs available through TrumpRx. The 43 drugs on offer, along with the advertised discounts: Abrilada pen (autoimmune) — TrumpRx price: $207.60 Airsupra (respiratory) — TrumpRx price: $201 Azulfidine Tabs (rheumatology) — TrumpRx price: $99.60 Azulfidine En Tabs (rheumatology) — TrumpRx price: $130.80 Bevespi (respiratory) — TrumpRx price: $51 Cetrotide (IVF) — TrumpRx price: $22.50 Chantix (smoking cessation) — TrumpRx price: $106.20 Cleocin (antibiotic) — TrumpRx price: $94.35 Colestid (cholesterol) — TrumpRx price: $127.91 Cortef (inflammation) — TrumpRx price: $45 Cytomel (thyroid) — TrumpRx price: $6 Diflucan (antifungal) — TrumpRx price: $14.06 Duavee (women's health) — TrumpRx price: $30.30 Estring (women's health) — TrumpRx price: $249 Eucrisa (dermatologic) — TrumpRx price: $158.48 Farxiga (diabetes, cardiovascular) — TrumpRx price: $181.59 Genotropin (human growth hormone) — TrumpRx price: $89.67 Gonal F (fertility) — TrumpRx price: $168 Insulin Lispro (high blood sugar) — TrumpRx price: $25 Levoxyl (hypothyroidism) — TrumpRx price: $35.10 Lopid (cholesterol) —TrumpRx price: $39.60 Medrol (inflammation) —TrumpRx price: $3.15 Ngenla (human growth hormone) — TrumpRx price: $2,217 Nicotrol (smoking cessation) — TrumpRx price: $271.16 Ovidrel (fertility) —TrumpRx price: $84 Ozempic Pen (diabetes, weight loss) — TrumpRx price: $199 Premarin (women's health) — TrumpRx price: $99 Premarin Vaginal Cream (women's health) — TrumpRx price: $236.65 Prempro (women's health) — TrumpRx price: $98.84 Pristiq (antidepressant) — TrumpRx price: $200.10  Protonix (heartburn) — TrumpRx price: $200.10 Tikosyn (cardiovascular) — TrumpRx price: $336 Toviaz (bladder control) — TrumpRx price: $43.50 Vfend (antifungal) — TrumpRx price: $306.98 Viracept (antiviral) — TrumpRx price: $607.20 Wegovy (weight loss) — Pen TrumpRx price: $199 Wegovy Pill (weight loss) — TrumpRx price: $149 Xeljanz (rheumatology) — TrumpRx price: $1,518 Xigduo Xr (diabetes) — TrumpRx price: $181.59 Zarontin (anticonvulsant) — TrumpRx price: $71.10 Zavzpret (migraine treatment) — TrumpRx price: $594.84 Zepbound (weight loss, sleep apnea) — TrumpRx price $299 Zyvox (antibiotic) — TrumpRx price: $122.74\nEdited by\nAlain\nSherter\nMore from CBS News\nWhite House launches TrumpRx discounted drug site\nTrump Accounts to get their own Super Bowl ad. Here's a preview.\nGateway Project may resume after judge blocks Trump's funding freeze\nNorth Texas man indicted in threats to kill President Trump and ICE agents\nGo deeper with The Free Press\nTrump’s Ozempic Deal Will Make America Slim Again\nThe Elon-Trump Bromance Crashes and Burns\nIn:\nTrump Administration\nWhite House\nHealth Care\nTrump to launch TrumpRX prescription drug pricing site\nTrump to launch TrumpRX prescription drug pricing site\n00:32\nTrump to launch TrumpRX prescription drug pricing site\n(00:32)\nWhite House launches TrumpRx discounted drug site\nTrump Accounts to get their own Super Bowl ad. Here's a preview.\nGateway Project may resume after judge blocks Trump's funding freeze\nTrump’s Ozempic Deal Will Make America Slim Again\nView CBS News In\nCBS News App\nOpen\nChrome\nSafari\nContinue", "metadata": {"source": "https://www.cbsnews.com/news/trumprx-drugs-website-discount/", "title": "TrumpRx: See the 43 drugs available on the Trump ... - CBS News"}}, {"text": "ICE lawyer who told Minnesota judge ‘this job sucks’ has been removed from detail, DOJ says | The Independent\nStay up to date with notifications from The Independent Notifications can be managed in browser preferences. Not now Yes please Swipe for next article Your support helps us to tell the story Read more Support Now From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financials of Elon Musk's pro-Trump PAC or producing our latest documentary, 'The A Word', which shines a light on the American women fighting for reproductive rights, we know how important it is to parse out the facts from the messaging. At such a critical moment in US history, we need reporters on the ground. Your donation allows us to keep sending journalists to speak to both sides of the story. The Independent is trusted by Americans across the entire political spectrum. And unlike many other quality news outlets, we choose not to lock Americans out of our reporting and analysis with paywalls. We believe quality journalism should be available to everyone, paid for by those who can afford it. Your support makes all the difference. Read more A lawyer working for the U.S. Attorney’s office in Minnesota has been removed from that detail after\ntelling a federal judge “this job sucks” during a hearing\non Immigration and Customs Enforcement failures to\nfollow court orders. Julie Le, who is listed as an attorney for the Department of Homeland Security, was assigned to Minnesota to support the Department of Justice in immigration cases after a wave of lawsuits followed mass arrests under\nDonald Trump’s sweeping deportation efforts in the state. That detail is now “over,”\nThe Independent\nhas learned. The episode reveals the mounting frustrations among government attorneys that rarely boil over in public but are now beginning to spill out in courtrooms, where judges are increasingly\nfiring off warning signs\nabout the Trump administration’s legal barrage. “What do you want me to do? The system sucks. This job sucks,” said Le, according to a transcript from Tuesday’s hearing. “And I am trying every breath that I have so that I can get you what you need.” open image in gallery A government lawyer detailed to the US Attorney’s office in Minnesota has been removed from her post after breaking down in court and saying she wants to be held in contempt so she can get ‘24 hours of sleep’\n( AFP via Getty Images ) A federal judge hauled government attorneys to his courtroom Tuesday to find out why ICE\nfailed to comply with several court orders\nto swiftly release wrongly detained immigrants whose cases appeared on his docket. District Judge Jerry R. Blackwell wanted to hear from the government why he shouldn’t be holding officials in contempt for their “alarming” failures. Instead, the judge heard from a lawyer who appeared to be at a breaking point. “Sometime I wish you would just hold me in contempt, your honor, so that I can have a full 24 hours of sleep,” Le told the judge. According to court records, Le has been named as the government’s attorney on more than 80 immigration cases in the state since the beginning of the Trump administration’s Operation Metro Surge. Le told the judge she is simply “overwhelmed” by the number of legal challenges from Trump’s mass deportation dragnet. “I am here to make sure the agency understands how important it is to comply with court orders,” said Le, who reportedly appeared visibly upset during the hearing. She said it was like “pulling teeth” to get the Homeland Security and the Justice Department to follow court orders. In a statement to\nThe Independent , the Justice Department denied allegations that ICE isn’t following court orders and blamed judges for “overwhelming” their own courts by failing to prepare them. The Trump administration is “complying with court orders and fully enforcing federal immigration law” after “four years of de facto amnesty” under Joe Biden’s presidency, a spokesperson told\nThe Independent. “If rogue judges followed the law in adjudicating cases and respected the government’s obligation to properly prepare cases, there wouldn’t be an ‘overwhelming’ habeas caseload or concern over DHS following orders,” the spokesperson said. “The level of illegal aliens currently detained is a direct result of this Administration’s strong border security policies to keep the American people safe,” the person added. open image in gallery Trump’s Justice Department has pushed out dozens of career prosecutors and other staff who refused to take up politically charged cases, according to watchdog groups\n( REUTERS ) Le is among several government lawyers who appear to have been forced from their jobs after frank admissions in court hearings against the Trump administration. Last year, the Justice Department\nfired an attorney\nwho the Trump administration accused of sabotaging its case against Salvadoran immigrant Kilmar Abrego Garcia, whose mistaken removal from the United States to his home country ignited\na still-ongoing legal battle over his return and deportation. Erez Reuveni was initially placed on administrative leave last year after he expressed frustration with the government’s inability to respond to the court’s questions about Abrego Garcia’s case and admitted that “he should not have been sent to El Salvador.” Asked why the government could not simply ask El Salvador to return him, Reuveni replied: “The first thing I did when I got this case on my desk is ask my clients the same question.” Dozens of other career prosecutors across the country were forced out over their refusals to drop cases or under pressure to bring politically charged prosecutions against the president’s perceived enemies and longtime foes. At least five Trump-appointed U.S. Attorneys have resigned over political interference from the Trump administration, including prosecutors in Manhattan who were pressured to drop a case against former Mayor Eric Adams and a U.S. attorney in Virginia tasked with prosecuting New York Attorney General Letitia James. Last year, roughly 10,000 attorneys worked across the Justice Department and its components, including the FBI. The Trump administration has fired, forced out, or offered buyouts to roughly 5,500 attorneys and other Justice Department employees, according to Justice Connection, an advocacy group that has tracked departures. Meanwhile, top federal prosecutors in Minnesota\nare fleeing the office over mounting frustrations with the Trump administration’s anti-immigration agenda. At least eight more career prosecutors are leaving the U.S. Attorney’s office in Minnesota — one month after several others resigned\nunder pressure from the Justice Department to investigate the widow of Renee Good,\nwho was fatally shot by an ICE officer in Minneapolis last month. Veteran prosecutor Joseph Thompson, who was previously appointed by Trump to serve as Minnesota’s acting U.S. attorney and first assistant U.S. attorney, among at least six prosecutors who left last month. Thompson reportedly objected to the Justice Department’s refusal to investigate Good’s killing as a civil rights matter and was outraged by an alleged demand to pursue a criminal investigation into Good, according to people familiar with the matter who spoked to\nThe New York Times. Join our commenting forum Join thought-provoking conversations, follow other Independent readers and see their replies Comments Most popular Popular videos Bulletin Read next Thank you for registering Please refresh the page or navigate to another page on the site to be automatically logged in Please refresh your browser to be logged in", "metadata": {"source": "https://www.independent.co.uk/news/world/americas/us-politics/doj-ice-lawyer-judge-minnesota-contempt-b2914033.html", "title": "ICE lawyer who told Minnesota judge ‘this job sucks’ has been ..."}}, {"text": "ICE lawyer removed from Minnesota immigration detail after telling judge \"this job sucks\" - CBS Minnesota\nAll News\nTwin Cities News\nGreater Minnesota News\nWisconsin News\nWCCO Investigates\nCommunity Journalism\nPolitics\nImmigration\nCrime\nHealth\nYour Money\nGood Question\nFinding Minnesota\nNEXT Weather\nLive Radar\nClosings & Delays\nWeather Watcher Network\nLatest Sports\nCBS Sports HQ\nVikings\nTwins\nTimberwolves\nLynx\nWild\nUnited FC\nAurora FC\nGophers\nHigh School Sports Rally\nState Fair\nGood Question\nFinding Minnesota\nWCCO Investigates\nMental Health Matters\nTalking Points\nOn the Edge\nVietnam 50 Years Later\nFootprint to Murder\nHome for the Holidays\nSavor Asia\nStation Info\nWCCO-TV News Team\nLinks & Numbers\nContests & Promotions\nGalleries\nWCCO-TV Jobs\nDownload WCCO's App\nAdvertise\nMemorials\nWatch CBS News\nA government lawyer who told a judge that her job \"sucks\" during a court hearing stemming from\nthe Trump administration's immigration enforcement surge in Minnesota\nhas been removed from her Justice Department post, according to a person familiar with the matter. Julie Le had been working for the Justice Department on a detail, but the U.S. attorney in Minnesota ended her assignment after her comments in court on Tuesday, the person said. The person spoke on the condition of anonymity to discuss a personnel matter. She had been working for U.S. Immigration and Customs Enforcement before the temporary assignment. At a hearing Tuesday in St. Paul, Minnesota, for several immigration cases, Le told U.S. District Judge Jerry Blackwell that she wishes he could hold her in contempt of court \"so that I can have a full 24 hours of sleep.\" \"What do you want me to do? The system sucks. This job sucks. And I am trying every breath that I have so that I can get you what you need,\" Le said, according to a transcript. Le's extraordinary remarks reflect the intense strain that has been placed on the federal court system since President Trump returned to the White House a year ago with a promise to carry out mass deportations.\nICE officials have said the surge in Minnesota has become its largest-ever immigration operation\nsince ramping up in early January.\nSeveral\nprosecutors have left\nthe U.S. Attorney's office in Minnesota amid frustration with the immigration enforcement surge and the Justice Department's response to\nfatal shootings of two civilians by federal agents .  A second wave of departures hit the Minnesota office in recent days, including prosecutors who spearheaded a $250 million fraud case. An office that saw 70 assistant U.S. attorneys during the Biden administration now has\nas few as 17.\nLe was assigned at least 88 cases in less than a month, according to online court records.\nBlackwell told Le that the volume of cases isn't an excuse for disregarding court orders. He expressed concern that people arrested in immigration enforcement operations are routinely jailed for days after judges have ordered their release from custody. \"And I hear the concerns about all the energy that this is causing the DOJ to expend, but, with respect, some of it is of your own making by not complying with orders,\" the judge told Le. Le said she was working for the Department of Homeland Security as an ICE attorney in immigration court before she \"stupidly\" volunteered to work the detail in Minnesota. She arrived on Jan. 5 and told the judge that she wasn't properly trained for the assignment.\n\"We have no guidance or direction on what we need to do,\" Le said.  In one instance, the court had ordered a man's unconditional release, but Blackwell said he learned the government had imposed conditions that were not part of the court order. Le said trying to get it fixed was like \"pulling teeth.\" She said she wanted to resign from the job but couldn't get a replacement. \"Fixing a system, a broken system, I don't have a magic button to do it. I don't have the power or the voice to do it,\" Le said. Le and spokespeople for DHS, ICE and the U.S. Attorney's office in Minnesota didn't immediately respond to emails seeking comment. Kira Kelley, an attorney who represented two petitioners at the hearing, said the flood of immigration petitions is necessary because \"so many people being detained without any semblance of a lawful basis.\" \"And there's no indication here that any new systems or bolded emails or any instructions to ICE are going to fix any of this,\" she added.\nRead the full transcript below:\nJulie Le Court Transcript\nPage\nof\nIn:\nImmigration\nU.S. Immigration and Customs Enforcement\nMinnesota\nDonald Trump\nPolitics\nSt. Paul\nMinneapolis\nFeatured Local Savings\nU.S. attorney exodus could impact Minnesota fraud investigations\nHow the U.S. attorney exodus could impact Minnesota fraud investigations\n02:20\nHow the U.S. attorney exodus could impact Minnesota fraud investigations\n(02:20)\nView CBS News In\nCBS News App\nOpen\nChrome\nSafari\nContinue", "metadata": {"source": "https://www.cbsnews.com/minnesota/news/ice-lawyer-julie-le-this-job-sucks-minneapolis/", "title": "ICE lawyer removed from Minnesota immigration detail after ..."}}, {"text": "Student loan borrowers in default now able to keep tax refunds Skip to main content\nHome Personal Finance Cars Investing Retirement Lottery Shopping Tax Season Consumer Recalls Careers Coupons Cryptocurrency Real Estate Housing Market Embracing AI\nStudent loan borrowers in default now able to keep tax refunds Susan Tompor\nDetroit Free Press Show Caption\nHide Caption\nStudent loan borrowers may face wage garnishment Millions of Americans in default on their federal student loans could soon see their wages garnished, as the U.S. Department of Education moves to restart aggressive collections. Fox - 5 Atlanta The U.S. Department of Education announced that it will delay implementing involuntary collections on federal student loans. The National Consumer Law Center said Friday's announcement \"throws a lifeline to working and middle class families.\" Student loan borrowers who are in default now have some good news when it comes to debt collection. The U.S. Department of Education announced Friday, Jan. 16, that it will delay implementing involuntary collections on federal student loans, including administrative wage garnishment and the Treasury Offset Program. It's unclear, based on the\nEducation Department's statement,\nhow long the temporary delay will last. More details will likely be ahead. It's a temporary delay, but it might help ease some worries about whether you'd immediately lose your tax refund to debt collection as the\n2026 tax season approaches. In case you missed it:\nHow seniors can boost tax refunds with new deduction on 2025 returns This tax season is expected to provide sizable refunds to many people, which could drive consumer spending and keep the economy growing. But millions of student loan borrowers in default risked seeing their wages garnished and tax refunds seized, as the long forbearance program that began during the COVID-19 pandemic unwinds and debt collection involving tax refunds and wages resumed. The change comes after much political heat from advocacy groups, including an urgent letter sent in January to the Education Department calling for a delay to avoid what groups called \"an unprecedented default crisis\" ahead. Aissa Canchola Bañez, policy director at Protect Borrowers, said in a statement Friday that the Trump administration's earlier plan would have been \"economically reckless and would have risked pushing nearly 9 million defaulted borrowers even further into debt.\" “After months of pressure and countless horror stories from borrowers, the Trump administration says it has abandoned plans to snatch working people’s hard-earned money directly from their paychecks and tax refunds simply for falling behind on their student loans,\" said Canchola Bañez of Protect Borrowers, formerly called the Student Borrower Protection Center, a nonprofit advocacy organization. The National Consumer Law Center said Friday's announcement \"throws a lifeline to working and middle class families.\" Abby Shafroth, managing director of advocacy at the National Consumer Law Center, said student loan borrowers are \"buckling under the weight of outdated student loan policies that don’t reflect today’s high cost of living and affordability crisis.\" She said existing policies and protections were set decades ago and have not been updated to reflect how much money people need to live on, given the sizable increases in prices and the cost of living. For example, Shafroth said, the Education Department protects only the first $217.50 per week in wages from garnishment, an amount set in 2009. Similarly, she said, the Education Department protects only the first $750 per month of Social Security benefits from seizure, a protection set in 1996. This summer, the Education Department had paused a plan to resume garnishing Social Security benefits. Without reform, she said, \"turning on collection, largely paused since 2020, would therefore put working families and older adults who fall behind on student loans at risk of being pushed into poverty by the federal government.\" Reforms, Shafroth said, should include increasing the amount of income protected for basic needs set decades ago to reflect today’s much higher cost of living. According to the Education Department, the temporary delay announced Jan. 16 gives the department more time to implement major student loan repayment reforms under the Working Families Tax Cuts Act, which passed last year. And that should give borrowers more options to repay their loans to avoid debt collection. The changes include simplifying repayment options and providing an additional opportunity for borrowers to rehabilitate their federal student loans. The Working Families Act \"reduces the number of federal student loan repayment plans, eliminating a confusing maze of options and making it easier for borrowers to select either a single standard repayment plan or income-driven repayment plan that best meets their needs,\" according to the Education Department. A new income-driven repayment plan waives unpaid interest for borrowers with on-time payments whose payments do not fully cover accrued interest, the Education Department said, and that includes small matching payments from the Education Department in certain circumstances to ensure that outstanding principal is reduced each month. The new plan will be available for borrowers beginning July 1, 2026, the Education Department said. \"The delay in collections will give defaulted borrowers additional time to evaluate these new repayment options once they consolidate their loans or complete a repayment or rehabilitation agreement.\" Under the act, borrowers now have a second chance to rehabilitate a defaulted loan, allowing them to get their repayments back on track and get the loan out of default. Prior to passage of the act, the law permitted borrowers only a single shot at rehabilitation. \"The delay in collections will give defaulted borrowers additional time to begin the rehabilitation process, including the ability to rehabilitate their loan a second time,\" the Education Department said. During the delay, the department is encouraging borrowers in default to explore their options for resolving their defaulted student loans with the defaulted federal loan servicer. The department is continuing to report student loan defaults to credit reporting agencies, the Education Department said, which may adversely impact borrower credit reports. Mark Kantrowitz, a student loan expert and author, noted that federal income tax refunds were last offset for defaulted federal student loans in 2019, prior to the pandemic. About 1.4 million federal income tax refunds were offset then, he said, about 15.2% of the total number of defaulted borrowers. The Coronavirus Aid, Relief, and Economic Security Act, which was passed by Congress on March 25, 2020, suspended enforced collections for the duration of the payment pause. And there were further extensions to the payment pause. Kantrowitz estimates that almost 11 million borrowers will be in default by the end of March 2026. By his estimate, some 1.6 million borrowers likely would have had their federal income tax refunds offset. \"But, it could be more,\" he said. \"The federal government usually offsets the full income tax refund amount,\" Kantrowitz said. \"The only exception is when less than the full amount is needed to satisfy the defaulted federal student loan debt.\" Contact personal finance columnist Susan Tompor:  stompor@freepress.com . Follow he r\non X @tompor.\nFacebook\nTwitter\nEmail Share your feedback\nto help improve our site!", "metadata": {"source": "https://www.usatoday.com/story/money/2026/01/22/student-loan-collections-paused/88299000007/", "title": "Student loan borrowers in default now able to keep tax refunds"}}, {"text": "Student loans: Defaulted borrowers risk 2026 tax refunds Skip Navigation Markets Business Investing Tech Politics Video Watchlist Investing Club PRO Livestream Menu Key Points The Trump administration is predicting larger tax refunds for the 2026 season due to changes in the \"big beautiful bill,\" but the millions of student loan borrowers who are behind on their payments may miss out. The U.S. Department of Education can seize borrowers' entire tax refunds, including their child tax credit and earned income tax credit, if they're in default on their federal student loans.\nStudent loan holders can still take steps to protect their refunds for the 2026 tax season, experts say.\nHobo_018 | E+ | Getty Images President Donald Trump\nsaid in December that this spring may be the \" largest tax refund season of all time ,\" due to changes in the \" big beautiful bill .\" But student loan borrowers who are behind on their payments may miss out.\nThat's because the U.S. Department of Education can seize a borrower's entire tax refund — including their  child tax credit\nor\nearned income tax credit\n— if they're in default on their federal student debt. Around 9 million education loan holders are currently in a default status, according to\na recent estimate\nby Protect Borrowers, an advocacy organization.\nThe Trump administration\nannounced\nin April that it would resume Education Department collections activity, after a roughly five-year pause that began during the Covid pandemic. Some borrowers reported having their refunds seized last year, but this will be the first full tax season in which collections on student loan debt are back in force, experts said.\nIn addition to seizing tax refunds, the federal government can also garnish\nthe wages\nand Social Security benefits of people who owe it money.\nTax season is \"a heartbreaking time of year\" for many student loan holders, said Betsy Mayotte, president of The Institute of Student Loan Advisors, a nonprofit.\n\"Many borrowers in default are struggling financially in other areas and often count on their refunds to catch up on other bills such as rent or car payments,\" Mayotte said. \"Finding out their entire refund has been taken can be a severe blow.\"\nRead more CNBC personal finance coverage How Trump's child tax credit changes could impact your refund this season Some older Americans are 'unretiring' to keep up with cost of living: AARP survey Bitcoin sells off amid 'crypto winter.' What investors need to know It's Medicare Advantage open enrollment: What to know about switching plans Super Bowl ad featuring Trump accounts to air on Sunday — here's a first look Workers with student loan debt have less saved for retirement, Fidelity finds Millions may drop ACA coverage — and raise health insurance costs for everyone else Retirement savings 'lost and found' helps retirees track down old 401(k)s Bigger SALT cap may 'drive higher refunds,' tax expert says — who benefits What new Medicaid, SNAP work requirements mean for older workers Trump accounts could grow to $50,000 or more, president says. Advisors weigh in Housing affordability isn't just hurting buyers: More homeowners are falling behind Flying without a Real ID? You may owe $45 — or more — starting Feb. 1 What Trump Fed chair pick Kevin Warsh may mean for consumers Average tax refunds may be $1,000 higher, White House says. What to expect As ACA subsidies expire, health costs emerge as top economic worry for voters CNBC's Financial Advisor 100: Best financial advisors, top firms ranked As of Dec. 26,  the average refund  for individual returns was $3,167 during the 2025 filing season, up slightly from $3,138 in 2024, according to the latest IRS data. More than 42 million Americans hold student loans, and the outstanding debt exceeds  $1.6 trillion . Defaulted borrowers still have time to take steps to protect their tax refunds this year, experts say. Here's what to know.\nLearn if your tax refund is at risk\nBorrowers worried about the fate of their tax refund should first make sure they know exactly how far behind they are, said Nancy Nierman, assistant director of the Education Debt Consumer Assistance Program in New York. \"You are not subject to collections unless your debt is actually in default,\" Nierman said. \" Borrowers may think they are in default , but you have to miss at least nine months of payments before your loans are moved to this status.\" You can log into your account at\nStudentaid.gov\nto see how far behind you are; a pink banner on your dashboard may show up if your debt has officially reached default.\n\"If you are delinquent but not yet in default, explore all your repayment options,\" Nierman said. \"You may\nbe eligible for a more affordable payment plan based on your income.\" Enrolling in a forbearance or deferment should also stave off collection activity for a period, she added.\nIf you do learn that you're in default, contact the government's\nTreasury Offset Program's call center\nat 1-800-304-3107, said Kyra Taylor, a staff attorney at the National Consumer Law Center.\nBorrowers in default \"need to call right before they file their taxes,\" Taylor said.\nThe government generates a list of people who are in debt to different agencies and may have their tax refunds garnished. You'll be asked to provide your Social Security number to learn if you are on the list, Taylor said.\n\"If their name is not on the list, they're likely in the clear,\" she said.\nIf you are on the list for garnishment, you'll want to take steps right away to get current on your loans — and ideally before you file your taxes, Taylor said.\nGet current on student loans before filing taxes Getting current on your student loans or taking steps to do so may stop the government from seizing your tax refund. But it can take between 30 days and 10 months to get out of default, so some borrowers may consider\nrequesting an extension to file their tax return , Taylor said. Doing so is easy and free, and automatically extends your deadline to file federal taxes from April 15 to Oct. 15. (Borrowers who aren't sure if they'll owe taxes or receive a refund may benefit from\npreparing a mock return\nbefore the April 15 deadline. \"Filing an extension does not extend the time to pay taxes owed,\" said Kathleen Boyd, a certified financial planner and founder of Student Loan Savvy. If you do have a tax obligation, you'll need to pay by the original deadline to avoid incurring interest and penalties, she said.) You are not subject to collections unless your debt is actually in default. Nancy Nierman assistant director at EDCAP\nApplying for a loan consolidation\nis typically the fastest way to get out of default, Taylor said. The process can be completed in as little as four weeks, she added. But some defaulted borrowers may be required to make several on-time payments before they can consolidate, and not all borrowers will qualify, including some who've already consolidated their loans or are facing wage garnishment.\nConsolidating your loans, which involves repackaging your federal student debts into a new federal student loan, can also lead you to lose progress on your forgiveness timeline under some repayment plans, Taylor said.\nBorrowers may also lose out on current repayment options\nif the consolidation wraps up after June, due to Trump's \"big beautiful bill.\"\nAnother way to get out of default is through\na loan rehabilitation . That process involves making \"nine voluntary, reasonable and affordable monthly payments,\" according to the U.S. Department of Education. Those nine payments can be made over \"a period of 10 consecutive months,\" it notes on the StudentAid.gov site. If you can't finish the agreement before filing your taxes, you can try contacting your loan servicer and asking if they'll stop collection anyway, Taylor said. They may agree to do so if you start rehabilitation not long after receiving a notice of default or if you've already made five rehabilitation payments.\nAfter taking these steps, Taylor recommends calling the Treasury hotline back before submitting your taxes. If your name is no longer on the garnishment list, you can file with more peace of mind.", "metadata": {"source": "https://www.cnbc.com/2026/01/14/student-loans-default-tax-refunds-garnishment.html", "title": "Student loans: Defaulted borrowers risk 2026 tax refunds - CNBC"}}, {"text": "Bad Bunny’s halftime show – What it means for Puerto Rico Skip to main content\nHome Movies Celebrities TV Music Books Broadway Theatre Crosswords Games Entertain This! Celebrity Deaths Horoscopes American Influencer Awards USA TODAY Acoustic Streaming\nWhat Bad Bunny’s halftime show means for Puerto Rico Rebecca Morin\nUSA TODAY Show Caption\nHide Caption\nWhy did the NFL pick Bad Bunny for the Super Bowl? The NFL's Bad Bunny pick for the Super Bowl halftime show was likely not politically motivated. USA TODAY's Pamela Avila explains. For three hours last summer, Wilfredo José Burgos-Matos felt like he didn’t have to leave Puerto Rico again after moving away from the island 11 years ago. Bad Bunny’s residency\nin San Juan last August hit Burgos-Matos like a wave of nostalgia, from the plena-style rhythm mixed with reggaeton and salsa filling \"El Choli\" coliseum to the pink casita and mountains built for the stage, bringing him back to his hometown of Aibonito, Puerto Rico.  “It just very honestly made me kind of realize, or even dream a little bit, about staying and not having to live again and go through this diaspora mourning, or this grief of always being in constant movement outside of the island,” the 33-year-old said. “It’s some sort of a gift that that Bad Bunny gave to Puerto Ricans.” Now,\nBad Bunny\nis bringing that same energy to one of the biggest global stages this weekend: the\nApple Music Super Bowl LX Halftime Show . Bad Bunny has repeatedly centered Puerto Rico in his music and his career, including his latest album, “Debí Tirar Más Fotos,” and his recent 31-date\n“No Me Quiero Ir de Aquí” residency\nin San Juan that generated millions into the island’s local economy. Bad Bunny, whose name is\nBenito Antonio Martínez Ocasio , has hinted his performance will be about unity during the trailer for the halftime show, where he danced with people from various ages and from diverse backgrounds, cultures and ethnicities.  But it will also, undoubtedly, be about Puerto Rico. “Benito speaks first and foremost to Puerto Ricans, and so he doesn't really care what other people think, and I think that's part of the formula for his success,” said Jorell Meléndez-Badillo, associate professor of Latin American and Caribbean History at the University of Wisconsin-Madison. Bad Bunny leans into Puerto Rican pride Over the past decade, Bad Bunny has skyrocketed to one of the world's biggest superstars, going from a local supermarket bagboy-turned-SoundCloud-rapper to the\nmost streamed artist across the globe . Through it all, he’s leaned into his Puerto Ricanness.  Boricua slang like perreo (a type of dance linked to reggaeton music), janguear (to hang out) and bichiyal (a stylish woman) are sprinkled throughout many of Bad Bunny’s songs. He's worn a pava, a traditional Puerto Rican straw hat, on red carpets and in the promo for the Super Bowl. He highlighted the struggles Puerto Ricans experienced on the island following the devastating back-to-back hurricanes, including Hurricane Maria, in 2017, during a\ndocumentary-style music video\nfor his hit, “El Apagon.” He’s highlighted the ongoing gentrification in Puerto Rico, including in his song “Lo Que Le Pasó a Hawaii” on his latest album.  “When you have a Puerto Rican, like Bad Bunny, appear on this massive platform, it is some sort of a reminder to viewers that Puerto Rico exists,” said Burgos-Matos, a Caribbean music academic. “That Puerto Ricans are not just consumers of U.S. culture or passive participants of the U.S.” The rapper has also boosted\ntourism to the island . His residency last summer alone brought in estimates of\n$200 million\nto more than\n$700 million\nto Puerto Rico.  Bad Bunny shines a light on Puerto Rico’s history But Boricuas in the United States and on the island are hoping that viewers of the halftime show will do more than just Google tickets to visit the island. Instead, some are hoping it will shine a light on the island’s deep history – and its complicated relationship with the United States. Burgos-Matos, who left Puerto Rico more than a decade ago to further his education and now has a doctorate, currently lives in the Bronx, “an extension of Puerto Rico,” he said. His journey is one that many in the diaspora take.  Roughly 5.8 million Puerto Ricans live in the United States, according to\nPew Research Center . Another 3.2 million live on the island, which is a U.S. territory, according to\nthe U.S. Census Bureau .  “There is a lot of trauma that Puerto Rico and Puerto Ricans have been enduring for the past years with, not only with the ongoing colonial status, but also the economic crisis, the mass migration, the unpayable debt,” he said. “This…is a form of asserting some sort of cultural survival.” Mikey Cordero, an artist living in Santurce, Puerto Rico, a neighborhood in the island’s capitol, said that Puerto Rico often “gets pushed to the side” politically and in media.  Specifically, Cordero hopes the performance will open a conversation about “colonization” and how laws in place, like the Jones Act, affect Puerto Rico’s economy. Puerto Rico is an unincorporated U.S. territory, and has long been the subject of the debate on whether the island should become a state or an independent country.  “He's giving you breadcrumbs into the Puerto Rican experience,” Cordero, 42, said. “I think if it brings more attention and more eyes on our story and our fight and our struggle – that's what I think even Bad Bunny wants – for you to like walk away with, to have that sense of prioritizing the Puerto Rican story.” 'The more local Bad Bunny gets, the more universal he becomes' Puerto Rico’s story is a relatable one.  And some Boricuas anticipate that people from different ethnic and racial backgrounds won’t feel excluded. Instead, they’ll feel seen. Meléndez-Badillo, who collaborated with Bad Bunny by writing historical narratives for videos for the artist’s latest record, said the reggaeton superstar explores themes around displacement, gentrification, and longing for home. “Those are things that people can connect with regardless if they're from Puerto Rico or not,” he said. “Those are the things that people from the Global South have been dealing with for a long time.” Dámaris Otero-Torres, an associate professor at Rutgers University\nwho is teaching a class on the Puerto Rican star, said Bad Bunny’s message in his music is universal and can create solidarity, even as he makes “sure that people understand the richness of Puerto Rico and all the things that it has to be, not only the U.S. and its community, but the world.” Him being chosen as an artist who sings and speaks almost entirely in Spanish is also a political act, Otero-Torres said, especially at a time in the United States where she says knowing another language is seen as a “liability.” “Why can't you open yourself to learn of the richness of the vastness of the culture? … The United States is an incredible melting pot,” she said. “Speaking another language is not a liability. It enriches you. It allows you not only to understand other cultures, but to understand your own culture in deeper ways.” The more local Bad Bunny gets, the more universal he becomes, Otero-Torres, who is from the Río Piedras neighborhood in San Juan, recalled reading recently.  “I think that's true,” she said.\nFacebook\nTwitter\nEmail Share your feedback\nto help improve our site!", "metadata": {"source": "https://www.usatoday.com/story/entertainment/music/2026/02/06/bad-bunny-super-bowl-halftime-show-puerto-rico-impact/88302878007/", "title": "What Bad Bunny’s halftime show means for Puerto Rico"}}, {"text": "MSN", "metadata": {"source": "https://www.msn.com/en-us/news/technology/super-bowl-lx-to-be-played-in-heart-of-silicon-valley-where-pears-sprouted-before-microprocessors/ar-AA1VBIdk", "title": "Super Bowl LX to be played in heart of Silicon Valley, where ..."}}]