[{"text": "7 states tinker with congressional maps after California offsets Texas Skip to main content\nHome U.S. Politics Sports Entertainment Life Money Tech Travel Opinion Crossword\n7 states tinker with congressional maps after California, Texas changes California hopes to flip five Republican seats to Democrats after Texas adopted a map to give five seats to the GOP. The advantage for November remains unclear as Florida and Virginia remain in flux. Bart Jansen\nUSA TODAY Show Caption\nHide Caption\nTrump reacts after Indiana Senate rejects GOP redistricting plan The Indiana Senate killed the GOP redistricting bill as President Donald Trump and leaders react with both sharp criticism and praise. WASHINGTON – The jockeying between Republicans and Democrats\nfor advantage in the 2026 congressional elections\ncontinues after\nthe Supreme Court\nrefused to review\nCalifornia’s redistricting plan , as another seven states are in the midst of redrawing maps for partisan gains. The\nhigh court refused on Feb. 4\nto hear a challenge to California’s ballot initiative to redraw its maps in a way that could shift five House seats from Republican to Democrat. The decision\nfollowed one in December\nthat allowed Texas to use a map that could flip five seats the other way, from Democrat to Republican. The competition is fierce because the\nHouse is narrowly divided\nand Democrats could regain control of the chamber from Republicans by flipping three seats. The  National Conference of State Legislatures  calls it the biggest flurry of  mid-decade redistricting since the 1800s . Some states are trying to redraw maps to gain just one more seat for their leading party. The stakes are high because a change in House control from Republicans to Democrats could lead to bigger disputes over spending – after two government shutdowns in one year – and more investigations of\nPresident Donald Trump . The House has 218 Republicans and 214 Democrats. Three seats – formerly held by Republicans in Georgia and California, and a Democrat in New Jersey – are vacant. The 2026 midterm elections will decide all 435 House seats and one-third of the Senate. The movement kicked off when Trump encouraged Republican-led states to redraw their maps to gain more seats. Democratic-led states embarked on their own redistricting in response, as illustrated by California’s response to Texas. “ Donald Trump\nsaid he was ‘entitled’ to five more Congressional seats in Texas,” California Gov. Gavin Newsom\nsaid on social media on Feb. 4 . “He started this redistricting war. He lost, and he’ll lose again in November.” The census, which counts the U.S. population every decade, determines how many House seats each state has under the Constitution. Congressional maps are traditionally redrawn then to adjust for population shifts. The push to redraw maps in the middle of the decade is unusual. But the\nSupreme Court ruled in 2019\nthat partisan maps cannot be challenged, even if racially discriminatory maps could be. Four Republican-led states are still working on new maps: Florida Gov. Ron DeSantis called a special legislative session\nin April for redistricting that analysts said could hurt three to five Democratic incumbents. The GOP already controls 20 of the state's 28 U.S. House seats, after lawmakers approved a 2021 map that flipped four Democratic seats. The redistricting effort faces a legal hurdle in a constitutional amendment barring lawmakers from drawing districts purely for partisan gain. In Ohio, a quirk in state law\nrequired a new map in 2026\nbecause the previous one was approved without Democratic votes. Republicans hold 10 of the state’s 15 U.S. House seats. The redistricting commission, which has five Republicans and two Democrats, unanimously approved a map in October that boosts GOP chances of flipping two Democratic districts. Missouri Gov. Mike Kehoe signed a new map into law in September that dismantled a Kansas City seat held by Democrats. Republicans now hold six of the state’s eight U.S. House seats. Several organizations filed lawsuits challenging the map's legality as opponents try to force a voter referendum on it. North Carolina’s\nGOP-led legislature approved a new map in October\ndesigned to flip a Democratic seat. Under state law, Democratic Gov. Josh Stein had no say in the process. Republicans hold 10 of the state’s 14 U.S. House seats. Two Republican-led redistricting efforts failed: In Indiana, the\nGOP-controlled Senate rejected a map\naimed at giving all nine U.S. House seats a Republican advantage, in a rare rebuke of Trump. Democrats hold two seats now.  In Kansas, Republicans abandoned a Trump-backed redistricting effort after state House Speaker Dan Hawkins said in January there wasn’t enough support to overcome a veto threat from Democratic Gov. Laura Kelly. Republicans hold three of the state’s four U.S. House seats. Three states are working on new maps that could help Democrats: In Virginia, the Democratic-led legislature approved a constitutional amendment in January to give lawmakers the power to redraw the state’s congressional map to flip as many as four seats. But the measure must still face state voters in a special election in the spring.\nA state judge blocked the map in January\nand Democrats appealed the decision. Democrats now hold six of the state’s 11 U.S. House seats. In Utah, a state judge threw out a GOP-drawn map as illegally partisan. Instead, the judge implemented an alternative that could flip one of the state’s four Republican-held seats to Democrats.  In New York, a state judge ordered the independent redistricting commission in January to redraw a GOP-held district based in Staten Island, which could give Democrats a chance to flip the seat. Rep. Nicole Malliotakis, R-New York, whose seat is at stake, appealed the ruling. Democrats hold 19 of the state’s 26 U.S. House seats. A redistricting effort in Democratic-led Maryland has stalled. The state House advanced a new map on Feb. 2 that targeted the state’s only GOP seat. But state Senate President Bill Ferguson said there isn’t enough support in his chamber and he doesn’t plan to hold a vote on the bill. Contributing: Reuters\nFacebook\nTwitter\nEmail Share your feedback\nto help improve our site!", "metadata": {"source": "https://www.usatoday.com/story/news/politics/2026/02/04/congressional-redistricting-california-texas-florida-virginia/88515239007/", "title": "7 states tinker with congressional maps after California, Texas changes - USA Today"}}, {"text": "U.S. Supreme Court Won’t Block New U.S. House Districts in California |\n↓\nHome\nMenu ↓\nSkip to primary content\nSkip to secondary content\nHome → Uncategorized → U.S. Supreme Court Won’t Block New U.S. House Districts in California\nOn February 4, the U.S. Supreme Court denied the request of some California Republicans to block new boundaries for U.S. House districts.\nTangipa v Newsom, 25A839.\nThat is…surprisingly rational coming from the current SCOTUS majority, but it makes sense. They let Texas’ partisan gerrymander stand, so it followed that they had to let California’s too, or risk losing whatever iota of credibility and perceived nonpartisanship they had left; they’re already seen by many people as being too subservient to the Trump regime.\nanother 1857 Dred Scott type result from SCOTUS hacks\n1/2 or less votes x 1/2 rigged cracked/packed gerrymander dists = 1/4 or less control laws\nmuch worse extremist primary math\nZ-E-R-O ***COMPETITIVE*** G DISTS IN ALL STATES IN GENL ELECTIONS ???\n—\nPR\nAPPV\nTOTSOP\n(ORDER LIST: 607 U.S.)\nWEDNESDAY, FEBRUARY 4, 2026\n25A839 ORDER IN PENDING CASE\nTANGIPA, DAVID, ET AL. V. NEWSOM, GOV. OF CA, ET AL.\nThe application for writ of injunction pending appeal\npresented to Justice Kagan and by her referred to the Court is\ndenied.\nhttps://www.scotusblog.com/2026/02/supreme-court-allows-california-to-use-congressional-map-benefitting-democrats/\nSB STORY\nUNDER 25 PCT MINORITY RULE IN NOV 2026 RIGGED ELECTION ???\n————\nCA USA REPS, NOV 2024 ELECTION, SUMMARY V.1\n52 RIGGED CRACKED/PACKED GERRYMANDER DISTS\nLINE\t VOTES \t PCTTO \t * ANTI-DEMOCRACY MINORITY RULE PCTS\n1\t   4,114,660 \t *25.5 \t27 LOW D* WIN-3 D*D, 1 D*O, 23 D*R\n2\t   3,600,548 \t            22.3 \t+ 16 HIGH D WIN-16 DR\n3\t   7,715,208 \t *47.8 \t= 43 D WIN\n4\t   1,715,952 \t            10.6 \t+ 9 R WIN-8 RD, 1 RR\n5\t   9,431,160 \t            58.4 \t= 52 WIN\n6\t   1,423,501 \t              8.8 \t11 D LOSE-3 D*D, 8 RD\n7\t   4,212,132 \t            26.1 \t+ 40 R LOSE-23 D*R, 16 DR, 1 RR\n8\t        44,450 \t              0.3 \t+ 1 OTH LOSE- 1 D*O\n9\t   5,680,083 \t            35.2 \t = 52 LOSE\n10\t 15,111,243 \t            93.6 \t = 104 ALL\n11\t   1,028,801 \t              6.4 \t + NONVOTES – 3 DD, 1 RR\n12\t 16,140,044 \t          100.0 \t = TURNOUT-TO\n13\t      310,385 \t            1.92 \t TO/52 = PCT AVE PA 100.0\n14\t   9,138,709 \t            56.6 \t 54 D- 3 D*D\n15\t   5,928,084 \t            36.7 \t 49 R- 1 RR\n16\tNO WIN VOTES OVER 310,385 PA 100.0\n17\tMAXWIN\n274,796\n/ MINWIN\n89,484 = 3.07\n18\tMAXLOSE 188,067 / MINWIN 89,484 = 2.10\n19\t37 LOSE ( 9 D, 28 R ) GOT MORE VOTES THAN MINWIN 89,484\n20\t 6,489,366 \t* 40.2\t27 LOW DTS-2 D*D, 1 D*O, 19 D*R, 2 DR, 2 RD, 1 RR\n21\t 8,621,877 \t53.4\t25 HIGH DTS- 1 D*D, 4 D*R, 14 DR, 6 RD\n22\t25 HIGH DTS\n8,621,877\n/ 27 LOW DTS\n6,489,366 = 1.33\n23\tMAXDT\n422,313\n/ MINDT\n167,507\n= 2.52\n24\tMAXLOSE 188,067 / MINDT 167,507 = 1.12\n25\t5 LOSE ( 3 D, 2 R ) GOT MORE VOTES THAN MINDT 167,207\n26\t https://www.sos.ca.gov/elections/prior-elections/\n27\tstatewide-election-results/general-election-nov-5-2024/statement-vote\n28\tSUPER-WORSE EXTREMIST MATH IN CA TOP 2 PRIMARY\n29\t— ESP WHEN GERRYMANDER DISTRICTS ARE CHANGED.\n30\t*** SAVE DEMOCRACY REMEDY – PROPORTIONAL REPRESENTATION—\n31\tTOTAL VOTES / TOTAL MEMBERS = EQUAL VOTES TO ELECT EACH\n32\tALL VOTES COUNT —– BOTH MAJORITY RULE [DEMOCRACY]\n33\tAND MINORITY REPRESENTATION.\nI do have to agree with AZ though that the gerrymandering itself really shouldn’t be happening at all, regardless of who’s doing it. But the nation would have been sent into even more political turmoil if SCOTUS had applied a double standard here.\nhttps://www.yahoo.com/news/articles/supreme-court-no-dissents-rejects-191044538.html\nLAT STORY\nWHAT WAS THE MINORITY RULE MATH AFTER THE NOV 1860 GERRYMANDER ELECTION ???\n>>>\n750,000 DEAD IN 1861-1866 — MANY EX-BLACK SLAVES STARVED TO DEATH IN 1865-1866 DUE TO TOTAL DESTRUCTION IN THE SOUTH – ESP RAILROADS\n“That is…surprisingly rational coming from the current SCOTUS majority, but it makes sense.”\nOn an issue as intensely watched as this, they have to show consistency to be credible.\nThere are a couple of ways that gerrymandering can be reduced.\nThe simplest would be to require that congressional districts have a minimum geographical size – such as 1,000 square miles.\nThis would compel states to make fewer districts, which could be multi-member or overlay districts.\nAnother way that might help would be to adopt the Wyoming Rule – which would expand the size of the House by about 120 members.\nThis would make the apportionment among states more proportional overall.\nOf course “Joshua H” (Stock) approves when Democrats change rules midstream but not Republicans.\n@AZ,\nHow many registered voters per district?\nAbstract\nIt is possible to end gerrymandering by removing the power to draw district lines from government officials and giving this power to the voters themselves. In a self-districting system, as described herein, each voter chooses which constituency the voter wants to join for purposes of legislative representation. These constituencies can be geographically based as in traditional districting systems, but they also can be based on other attributes—whatever associational communities the voters themselves wish to form. If enough voters join a constituency to form more than one district based on the constitutional principle of equally populated districts, then this constituency can be subdivided into districts based on strict computer-implemented geographical criteria without any possibility for gerrymandering. This self-districting system not only complies with the U.S. Constitution; it is also consistent with the Act of Congress that requires single-member districts. Thus, there is no federal law obstacle to prevent states from adopting a self-districting system for both their congressional delegation and their own legislative chambers. In fact, self-districting is a way to avoid the problem of minority vote dilution, a task likely to become more difficulty given anticipated changes in the U.S. Supreme Court’s jurisprudence on the topic. Because of the increasingly pernicious nature of gerrymandered districts, which cause voters—and most especially minority voters—serious representational harms, the alternative of self-districting, where voters are empowered to make these representational decisions for themselves, deserves serious consideration.\nhttps://papers.ssrn.com/sol3/papers.cfm?abstract_id=4328642\nhttps://www.usatoday.com/story/news/politics/2026/02/04/congressional-redistricting-california-texas-florida-virginia/88515239007/\nrigged gerrymander machinations in more States in 2026\n—\nJ.R.\n2 TO 5 TIMES THE NUMBER OF VOTERS IN LAST REGULAR ELECTION FOR PREZ/GUV DIVIDED BT TOTAL MEMBERS IN LEGIS BODY.\n@DFR,\nHow might this work for Oklahoma’s five representatives? When and how would voters declare there affinity group? Could they change?\nwith the tyrant Trump non-stop crisis AND RIGGED GERRYMANDER SO-CALLED ELECTIONS —\nsee the fall of the olde Roman Republic — ESP FATAL MONARCH/OLIGARCH MACHINATIONS\nhttps://en.wikipedia.org/wiki/Roman_Republic\nESP ABOUT HALF DOWN *CONST” STUFF\nALL sorts of legislative / executive / judicial defects / FATAL SOP VIOLATIONS\nhttps://www.yahoo.com/news/articles/don-colossus-22-foot-tall-194622624.html\nTYRANT TRUMP HACKS AT WORK\nhttps://www.yahoo.com/news/articles/7-states-tinker-congressional-maps-230305149.html\ncrack/pack g wars in many States\nDFR said:\n“This self-districting system not only complies with the U.S. Constitution; it is also consistent with the Act of Congress that requires single-member districts.”\nIMO, this self-districting voting can only comply with the current requirement for single member districts if a voter gets only one vote in a multi-member state wide contest.\n@WZ,\nI believe you live in Massachusetts, so I’ll use that as an example. Imagine everyone gathered in a central location – say Worcester. When you checked-in you would be assigned a room based on your residence. We’ll send you to District 7, which is a ginormous room holding a few hundred thousand people. You all vote, and elect one representative. It probably would be more efficient to have these rooms distributed throughout the state, so District 7 might be located in Salem or Brockton. Or with modern communication you could have smaller rooms located in each election precinct.\nBut back to the original idea. When you check in, you are assigned District 9, surnames ending in T-Z. This complies with the US Constitution, since the representatives are chosen by the “People of Massachusetts” so long as there are roughly the same number of voters in each room (SCOTUS has said that the people of the state can’t be choosing their representatives if 200,000 choose one, and 300,000 choose another. They have said that if Massachusetts voters each had 9 votes, it would also would comply with the US Constitution). An at-large election of this sort would not comply with federal statute.\nIf Massachusetts created “districts” based on surnames it would be challenged in court. Even if it was ruled legal, Congress could change the law. But Congress could also require states to elect representatives by surname. At one time, Congress set standards for districts which include compactness and contiguity, implying areal districts. But they have eliminated those standards. Edward B. Foley, author of the law review article, asserts that “districts” formed on a basis other than area are districts.\nBut lets use a 3D model. We have a three story building in the shape of Massachusetts (or perhaps a 3-layer cake). Democrats are placed on the bottom floor, Republicans on the middle floor, and unenrolled and others on the third floor. Each voters in placed at their relative spatial position. We apportion 9 representatives: 6 unenrolled, 2 Democrats, 1 Republican. We divide the Democratic floor/layer into two rooms. The Republicans elect one representatives statewide. The unenrolled are divided into six rooms. The dist", "metadata": {"source": "https://ballot-access.org/2026/02/04/u-s-supreme-court-wont-block-new-u-s-house-districts-in-california/", "title": "U.S. Supreme Court Won't Block New U.S. House Districts in California |"}}, {"text": "270toWin - 2028 Presidential Election Interactive Map\nLATEST\nOverview and Live Results: New Jersey 11th Congressional District Special Primary\n2028 Presidential Election Interactive Map\nThis isn’t a popularity contest™\nIt will take 270 electoral votes to win the 2028 presidential election. Click states on this interactive map to create your own 2028 election forecast.\nCreate a specific match-up\nby clicking the party and/or names near the electoral vote counter. Use the buttons below the map to share your forecast or embed it into a web page.\nPrediction Markets\nWhich party will win the 2028 Presidential Election?\nProbability based on the most recent ‘yes’ trade\nfor each party as of\n. May not total 100%.\nDemocrats\nDemocrats\nButtigieg\nHarris\nNewsom\nOcasio-Cortez\nShapiro\nRepublicans\nRepublicans\nCruz\nDeSantis\nHaley\nRubio\nVance\nno 2028 election\nno 2028 election\nYou are viewing:\nVT\nNH\nMA\nRI\nCT\nNJ\nDE\nMD\nDC\nMap\n:\nMap Color Palette\n-\n+\nSafe\nLikely\nLeans\nTilt\nToss-up\n3P\nShow 3rd Party\nSplit Votes\nState\nDistrict\n1\n2\n3\nME\nNE\nUser-Created Map\nMap Library\nReset Map\nShare Map\n2024 Margin\n2024 Actual\nSame Since 2000\nBlank Map\nPct. Spread in 2024\nDetails >>\nCustomize your map by changing one or more states. Return here to share it.\nShare or Embed your Map: Select 'Share Map' button above.\nShare or Embed your Map:\nShare\nTweet\nPin\nShare\nEmail\nPermanent URL:\nEmbed Your Map\n×\nImage URL:\nInteractive Map URL:\nEmbed Code:\nPlace the map on your website with this code.\nCopy Code\nTip: The width in the code can be adjusted to best fit your space.\nClose\nHeadlines\nOverview and Live Results: New Jersey 11th Congressional District Special Primary\nFebruary 5, 2026\nDemocrats are expected to hold the seat vacated by Mikie Sherrill after she was elected governor. Special election is April 16.\nLive Results: February 3 State Legislative Special Elections and Primaries\nFebruary 3, 2026\nFive states hold contests in a week that will also see elections Thursday and Saturday\nLive Results: Texas Congressional and State Senate Special Election Runoffs\nJanuary 31, 2026\nA vacancy will be filled in Congress, but the more interesting runoff takes place near Dallas\nLive Results: Minnesota State House Special Elections\nJanuary 27, 2026\nTwo vacancies will be filled in this closely-divided chamber\nLive Results: January 20 Legislative Special Elections\nJanuary 20, 2026\nVacancies will be filled in Georgia and Virginia, with a special primary in New Hampshire\nPrediction Markets\nWhich party will win the 2028 Presidential Election?\nProbability based on the most recent ‘yes’ trade\nfor each party as of\n. May not total 100%.\nActual 2024 Electoral Map\nInteractive Maps\nPresident\nSenate\nHouse\nGovernor\nState Senate\nState House\n2026 Forecasts\nSenate\nHouse\nGovernor\n2026 Polls\nSenate\nHouse\nGovernor\nLatest News\nOverview and Live Results: New Jersey 11th Congressional District Special Primary\nLive Results: February 3 State Legislative Special Elections and Primaries\nLive Results: Texas Congressional and State Senate Special Election Runoffs\nContact Us\nMedia Inquiries\nAdvertising\nGeneral Feedback\nFollow 270toWin\nPrivacy Manager\n© 2026 Electoral Ventures LLC. All Rights Reserved.\nPRIVACY\nSITE MAP\nABOUT US", "metadata": {"source": "https://www.270towin.com/", "title": "270toWin - 2028 Presidential Election Interactive Map"}}, {"text": "Latest 2022 Senate Election Polls - 270toWin\nRecent 2022 Senate Election Polls\nThe most recent polls for the 35 Senate elections taking place in 2022. Select any location to view all polls and a polling average (where available) for that state. For direct links to Senate polling detail in each state,\nsee this map .\nHeadlines\nOverview and Live Results: New Jersey 11th Congressional District Special Primary\nFebruary 5, 2026\nDemocrats are expected to hold the seat vacated by Mikie Sherrill after she was elected governor. Special election is April 16.\nLive Results: February 3 State Legislative Special Elections and Primaries\nFebruary 3, 2026\nFive states hold contests in a week that will also see elections Thursday and Saturday\nLive Results: Texas Congressional and State Senate Special Election Runoffs\nJanuary 31, 2026\nA vacancy will be filled in Congress, but the more interesting runoff takes place near Dallas\nLive Results: Minnesota State House Special Elections\nJanuary 27, 2026\nTwo vacancies will be filled in this closely-divided chamber\nLive Results: January 20 Legislative Special Elections\nJanuary 20, 2026\nVacancies will be filled in Georgia and Virginia, with a special primary in New Hampshire\nRelated Content\n2022 Senate Interactive Map\n2022 Senate Simulator\nActual 2024 Electoral Map\nInteractive Maps\nPresident\nSenate\nHouse\nGovernor\nState Senate\nState House\n2026 Forecasts\nSenate\nHouse\nGovernor\n2026 Polls\nSenate\nHouse\nGovernor\nLatest News\nOverview and Live Results: New Jersey 11th Congressional District Special Primary\nLive Results: February 3 State Legislative Special Elections and Primaries\nLive Results: Texas Congressional and State Senate Special Election Runoffs\nContact Us\nMedia Inquiries\nAdvertising\nGeneral Feedback\nFollow 270toWin\nPrivacy Manager\n© 2026 Electoral Ventures LLC. All Rights Reserved.\nPRIVACY\nSITE MAP\nABOUT US", "metadata": {"source": "https://www.270towin.com/polls/latest-2022-senate-election-polls/", "title": "Latest 2022 Senate Election Polls - 270toWin"}}, {"text": "Latest 2026 Senate Election Polls - 270toWin\nRecent 2026 Senate Election Polls\nThe most recent polls for the 35 Senate elections taking place in 2026. Select any location to view all polls and a polling average (where available) for that state. For direct links to Senate polling detail in each state,\nsee this map .\nHeadlines\nOverview and Live Results: New Jersey 11th Congressional District Special Primary\nFebruary 5, 2026\nDemocrats are expected to hold the seat vacated by Mikie Sherrill after she was elected governor. Special election is April 16.\nLive Results: February 3 State Legislative Special Elections and Primaries\nFebruary 3, 2026\nFive states hold contests in a week that will also see elections Thursday and Saturday\nLive Results: Texas Congressional and State Senate Special Election Runoffs\nJanuary 31, 2026\nA vacancy will be filled in Congress, but the more interesting runoff takes place near Dallas\nLive Results: Minnesota State House Special Elections\nJanuary 27, 2026\nTwo vacancies will be filled in this closely-divided chamber\nLive Results: January 20 Legislative Special Elections\nJanuary 20, 2026\nVacancies will be filled in Georgia and Virginia, with a special primary in New Hampshire\nRelated Content\n2026 Senate Interactive Map\n2026 Senate Election Forecasts\nActual 2024 Electoral Map\nInteractive Maps\nPresident\nSenate\nHouse\nGovernor\nState Senate\nState House\n2026 Forecasts\nSenate\nHouse\nGovernor\n2026 Polls\nSenate\nHouse\nGovernor\nLatest News\nOverview and Live Results: New Jersey 11th Congressional District Special Primary\nLive Results: February 3 State Legislative Special Elections and Primaries\nLive Results: Texas Congressional and State Senate Special Election Runoffs\nContact Us\nMedia Inquiries\nAdvertising\nGeneral Feedback\nFollow 270toWin\nPrivacy Manager\n© 2026 Electoral Ventures LLC. All Rights Reserved.\nPRIVACY\nSITE MAP\nABOUT US", "metadata": {"source": "https://www.270towin.com/polls/latest-2026-senate-election-polls/", "title": "Latest 2026 Senate Election Polls - 270toWin"}}, {"text": "Democrats See Path to Senate Control in 2026: Watch These Races | TIME Updated:\nLoading... Democrats See Narrow Path to Winning Senate Control. Here Are the Races to Watch Politics The D.C. Brief ADD TIME ON GOOGLE Show me more content from TIME on Google Search by\nPhilip Elliott Senior Correspondent Republican Senators Susan Collins of Maine, and John Cornyn of Texas are among the incumbents facing strong challenges to re-election in the 2026 midterm elections. Republican Senators Susan Collins of Maine, and John Cornyn of Texas are among the incumbents facing strong challenges to re-election in the 2026 midterm elections. Jemal Countess—AFP via Getty Images by\nPhilip Elliott Senior Correspondent This article is part of The D.C. Brief, TIME’s politics newsletter. Sign up\nhere\nto get stories like this sent to your inbox. Less than two months before the primary season opens, it seems that both parties have a general sense of the Senate map.  Conversations with about two dozen strategists, lobbyists, donors, and rank-and-file Hill staffers reveal the current lay of the land: Democrats see an incredibly narrow path back to the majority, one that will require the kind of luck that has been in short supply for the party of late. Republicans, meanwhile, see a more favorable map that will likely result in them retaining Senate control, although the latest\npolling\nand voter registration\ntrends\nare certainly making party leaders skittish. For the GOP, the biggest wild card is the leader of their own party, as Donald Trump has a history of backing the less-electable horse in pivotal primaries. Strategists are hoping Trump will do better this cycle at\nmaintaining\nhis\nneutrality , or at least avoid elevating the kind of candidates who are so toxic they hurt Republicans in other races. While the Senate map remains in Republicans’ favor, non-presidential elections are famously tough to predict, and there is a political lifetime between now and November. Just the events of the last few weeks—the military seizure of\nVenezuela’s\nautocratic leader, Trump’s\nthreats to Denmark\nover Greenland, a\nmounting\nnational anti-ICE backlash—suggest any prediction about the midterms made in January of 2026 are slightly better than pure bunk. Advertisement First, let’s dissect the Democrats’ map. In a\nrecent\nstrategy memo, Senate Democrats’ campaign arm firstly and optimistically assumes the party will hold Michigan and New Hampshire, where Democratic incumbents are choosing not to seek another term, and Georgia, where Sen. Jon Ossoff is. (To recap: the current trio of Democratic Senators previously won those seats with an average of 52% of the vote. That holds the\nstatus quo . To move Democrats back to holding the Senate’s gavels, Democrats’ official playbook is to pursue flips in Alaska, Maine, North Carolina, and Ohio. Six years ago, Republicans won those first three seats with 54%, 51%, and 49%. The fourth, Ohio, is going to be a special election to fill the remainder of Vice President J.D. Vance’s term; he won in 2022 with 53% of the vote.  Put candidly, the Democrats’ plan for those four states is ambitious—but the trends are on their side. Special elections since November 2024 have delivered a slate of wins for Democrats, who have\noutperformed\nexpectations and historical trajectories.  Advertisement Then there are seats in Iowa and Texas that are viewed as more dreamy pick-up opportunities for Democrats. More on that below. Some of the Democrats’ open doors are thanks to Trump’s fickle nature. For instance, in North Carolina, Sen.\nThom Tillis\nwould have been on a glidepath to re-election. But Tillis ran afoul of Trump during the President’s first tour of Washington for such sins as working with Democrats on\nreforming\nimmigration policy and\ndefending\nRobert Mueller’s investigation into the 2016 elections, and\nopposing\nTrump’s effort to tap emergency budget powers to bypass Congress and build the border wall. But the final blow came last summer when Tillis voted against Trump’s mega-spending package, the One Big Beautiful Bill. The next day, Tillis announced he would not seek a third term. It’s a similar situation in Texas, Maine, and Louisiana, where Trump is bedeviling party leaders by his decision to not endorse the incumbents viewed as best positioned to keep their seats red.  Advertisement That said, the map is decidedly in Republicans’ favor. Just holding GOP seats in Alaska, Maine, North Carolina, and Ohio is the whole ballgame. Republicans are thirstily looking for some flips of their own, like New Hampshire, where former Sen. Scott Brown of Massachusetts and former Sen. John E. Sununu of New Hampshire are both running for an open seat. In Georgia, it’s a smorgasbord of GOP talent. And in Michigan, a Never-Trumper-turned-convert in former Rep. Mike Rogers is primed to face whoever emerges from a three-way primary that will serve as a litmus test for the Democrats. Oh, that’s right. Primaries! None of these nominees are officially set. That doesn’t start happening until March. The first major test will come in Texas, where everything—including risk—is always bigger.  Let’s take a tour of the 10 states where control of the Upper Chamber will be decided. Texas\nSen. John Cornyn, a former member of GOP Leadership and a guiding voice for pragmatic conservatives on the Hill, faces a real challenge to even win his party’s nomination for another six-year term when his state holds its primary on March 3. Emerson College’s polling this month shows Cornyn locked in a tight primary against Attorney General Ken Paxton, with Rep. Wesley Hunt running about 10 points behind both. Still, the plurality of voters there remain undecided. Senate Majority Leader John Thune has told reporters that Trump would not be making an endorsement in that race, although it’s far from assured that the President will keep his end of the bargain. Trump is fond of Paxton’s pluck and Hunt’s ambition. Some strategists worry that Texas Republicans may be about to trade away a reliably Republican seat if Paxton or Hunt emerge as the nominees. Advertisement The Democratic primary is also competitive, featuring feisty rising star Rep. Jasmine Crockett and state Rep. James Talarico, who has drawn national attention for his\nblending of Christian faith with a pragmatic policy raft . Trump absolutely loathes Crockett, who might bait the President to intervene in the GOP primary. North Carolina A sneaky and pricey addition to the map this year, North Carolina’s Senate race is the one that Republicans feel least confident defending. Michael Whatley, who served for 17 months as Trump’s hand-picked chairman of the Republican National Committee, had been expected to coast into the seat being vacated by Tillis. The reasoning was sound: the last Democrat to win a Senate seat in North Carolina was elected in 2008. But Democrats landed a major recruiting win with former Gov. Roy Cooper, who ran ahead of Hillary Clinton by 4 points in 2016 and by 6 points over Joe Biden four years later. Every single poll has shown Cooper besting Whatley. But holding the seat is a top priority for Thune and Senate Republicans’ campaign arm. The fact that Whatley is one of Trump’s favorites is lost on no one, as is the fact that Democrats have won the state’s presidential vote just twice since LBJ. Advertisement Ohio Oh, Ohio. The one-time swing state has sided with the presidential winner every time except for 1944, 1960, and 2020. But its status as a bellwether is far from its heyday. Sen. Jon Husted is seeking to defend the seat he inherited when J.D. Vance won the vice presidency in 2024. In picking Husted, Gov. Mike DeWine cleared some potential strife inside the state GOP he controls and set in motion what should have been a fairly easy hold. But former Sen. Sherrod Brown had other thoughts. Brown, who lost his seat in 2024, is the lone Ohio Democrat who has proven to be able to win statewide since the 2006 wave election, Brown has a machine in the state. And without Trump at the top of the ticket driving turnout, there’s a good shot that the 73-year-old fixture in Ohio politics can come back to Washington. Louisiana Louisiana should be an easy hold for Republicans, but who occupies the seat has become a moving target now that Trump decided to mess with Sen. Bill Cassidy’s re-nomination. The President’s unexpected endorsement of Rep. Julia Letlow—before she even joined the race, mind you—added a complication for Cassidy, who voted to convict Trump in his impeachment over the Jan. 6, 2021, insurrection at the Capitol yet set aside his own reservations as a doctor over the nomination of an anti-vaxxer to be the nation’s health secretary. Not even that concession—which has dogged Cassidy ever since—was enough to satiate Trump’s mounting obsession with revenge. Advertisement Thune had desperately hoped Trump would stay out of Louisiana. Just this month, Thune popped down to the state to stand with Cassidy and make stops to boost his standing. After all, Cassidy chairs the Senate health and education committee and is already playing a crucial role in steering Senate Republicans’ agenda. Poking Cassidy out of spite is a very Trumpian move but not one that leaves Democrats eyeing the race with any seriousness. After all, the last time Louisiana voters sent a first-term Democrat to the Senate was 1996. Georgia This is the race that keeps Democrats up at night. Jon Ossoff is far-and-away this cycle’s biggest\nfundraiser , hauling in $54 million for the cycle and showing no signs of slowing. Still, this is Georgia, a state that has voted for a Democratic White House contender just twice since Jimmy Carter’s days. Trump is the big unknown here. He has yet to make an endorsement and his record in Georgia is mixed at best. (He\ndelivered\nNFL player Herschel Walker the Senate nomination in 2022 but\nfailed\nto kill Gov. Brian Kemp’s re-nomination that same primary.) This year, it’s Reps. Mike Collins and Buddy Cart", "metadata": {"source": "https://time.com/7357434/democrats-2026-elections-senate-races-donald-trump-texas-maine-michigan/", "title": "Democrats See Path to Senate Control in 2026: Watch These ..."}}, {"text": "MSN", "metadata": {"source": "https://www.msn.com/en-us/news/politics/democrats-chances-of-flipping-the-house-from-republicans-in-2026/ar-AA1T9Cra", "title": "Democrats' chances of flipping the House from Republicans in 2026"}}, {"text": "Use of Presidential Drawdown Authority for Military Assistance for Ukraine - United States Department of State\nSkip to content\nAn official website of the United States Government\nHere's how you know\nOfficial websites use .gov\nA\n.gov\nwebsite belongs to an official government organization in the United States.\nSecure .gov websites use HTTPS\nA\nlock (\n)\nor\nhttps://\nmeans you’ve safely connected to the .gov website. Share sensitive information only on official, secure websites.\nSearch:\nSearch\nClose\nHome Remarks and Releases – Bureau of Political-Military Affairs\n... Use of Presidential Drawdown Authority for Military Assistance for Ukraine\nhide\nUse of Presidential Drawdown Authority for Military Assistance for Ukraine\nFact Sheet\nBureau of Political-Military Affairs\nJanuary 20, 2025\nThe use of the Presidential Drawdown Authority to direct a drawdown to provide military assistance under section 506(a)(1) of the Foreign Assistance Act (FAA) is a valuable tool of U.S. foreign policy in crisis situations. [1]    It allows for the speedy delivery of defense articles and services from Department of Defense stocks to foreign countries and international organizations to respond to unforeseen emergencies.  Such assistance can begin arriving within days—or even hours—of approval.\nConsistent with his overall responsibilities for the direction and coordination of foreign assistance, the Secretary of State plays a central role in the initiation and coordination of these drawdowns. After initial engagement with Congress, the Secretary requests the President’s authorization to notify Congress of the intent to exercise the drawdown authority under section 506(a)(1) of the FAA and seeks delegated authority from the President to make the necessary determinations and to direct the drawdown. The Department of State is also responsible for coordinating the implementation of the drawdown with the Department of Defense. For Ukraine, the Secretary has exercised authority delegated by the President to direct 55 drawdowns of defense articles and services totaling approximately $31.7 billion from DoD stockpiles since August 2021, in response to Russia’s preparation to launch the February 24, 2022 full-scale invasion of Ukraine and continued war.\n[2]\nThroughout this process, the United States is providing Ukraine vital military assistance to defend itself against Russia’s unprovoked and brutal aggression, which amounts to internationally condemned war crimes.  In support of this effort, Congress has progressively increased the cap on this drawdown authority from $100 million to $11 billion for Fiscal Year 2022, most recently in the Additional Ukraine Supplemental Appropriations Act, 2022 (P.L. 117-128), which was signed into law by the President on May 21. Since August 2022, the Administration has utilized this Presidential Drawdown Authority\n55\ntimes to provide military assistance to Ukraine.\nOn August 14, 2023, the Department announced the first of several packages utilizing previously authorized PDA Authority. During DoD’s regular oversight of their execution of previous Presidential Drawdown Authority for Ukraine, they discovered that they had been incorrectly overvaluing the weapons and equipment in previous PDAs that had been authorized or Ukraine. DoD then undertook a review using the appropriate accounting method, which restored $6.2 billion that can be used under Congressionally authorized drawdown authority to provide arms and equipment to meet Ukraine’s urgent security requirements. As PDA is an authority, not a funding source, once notified to Congress there is no ‘expiration date’ for the provision of defense articles and services up to the value that was notified.  Any additional space within the previously notified PDAs, identified as a result of DOD’s recalculation of the value of previous PDAs therefore remains available for Ukraine regardless of the end of the fiscal year.\nOn September 26, 2024, the Department notified Congress of the intent to direct the drawdown of up to approximately $5.55 billion in defense articles and services from DoD stocks for military assistance to Ukraine under Presidential Drawdown Authority. This drawdown, if directed, will utilize the remaining authority of the Presidential Drawdown Authority under section 506(a)(1) of the Foreign Assistance for fiscal year 2024 provided by the Ukraine Security Supplemental Appropriations Act, 2024 (Div. B, P.L. 118-50) (USSAA), which will expires on September 30, 2024. As a result of this planned drawdown, the United States will be able to continue to provide defense articles and services to Ukraine from DoD stocks under Presidential Drawdown Authority on a continual basis and remains available for Ukraine regardless of the end of the fiscal year.\nThough the delivery of assistance under a drawdown is generally much faster than under other security assistance authorities because the Defense Department already has the articles or services in-hand, it comes with similar safeguards.  The Department vets Ukraine’s security force units nominated for assistance under the drawdown.  In compliance with the Leahy law and in coordination with the Government of Ukraine, the Department works to ensure assistance does not go to units credibly implicated in gross violations of human rights.  As with all transfers of defense articles and services to partners under the FAA, Ukraine is bound by an agreement with the United States not to transfer such items to third parties or unauthorized users.  In addition, the Department of Defense leads a technological security review to determine what items may be transferred without putting the U.S. warfighter’s edge at risk.  The Department is confident in Ukraine’s commitment and ability to uphold these agreements.\nThe authority to provide military assistance through a drawdown has been used to support Allies and partners in crisis all over the world.  It remains the U.S. government’s most responsive tool to rapidly transfer U.S. military and other equipment in an unanticipated emergency that cannot be addressed by other means.\nA summary of the U.S. military assistance provided under drawdowns for Ukraine is available in our fact sheet on  U.S. Security Cooperation with Ukraine .\nFor further information, please contact the Bureau of Political-Military Affairs, Office of Congressional and Public Affairs at\nT_Outreach_PM@state.gov , and follow the Bureau of Political-Military Affairs on Twitter,\n@StateDeptPM .\n[1]  This fact sheet focuses on drawdowns for Ukraine directed under section 506(a)(1) of the  Foreign Assistance Act   ( 22 U.S.C. 2318(a)(1)  ).  The President also has other authorities to direct drawdowns from DoD or other U.S. government agency stocks to provide assistance for other purposes.\n[2]  Several of these drawdowns have been in conjunction with the exercise of the authority under section 614 of the FAA.\nTags\nBureau of European and Eurasian Affairs\nBureau of Political-Military Affairs\nPolitical-Military Cooperation\nSecurity and Defense Cooperation\nSecurity Partnerships and Assistance\nUkraine\nBack to Top\nCookie Settings\nWe use cookies to make our website work better and improve your experience. By continuing to use the site, you agree to our privacy policy.\nFunctional\nFunctional\nAlways active\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nPreferences\nPreferences\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nStatistics\nStatistics\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nMarketing\nMarketing\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.\nManage options\nManage services\nManage {vendor_count} vendors\nRead more about these purposes\nAccept\nDeny\nView preferences\nSave preferences\nView preferences\n{title}\n{title}\n{title}\nCookie Settings\nWe use cookies to make our website work better and improve your experience. By continuing to use the site, you agree to our privacy policy.\nFunctional\nFunctional\nAlways active\nThe technical storage or access is strictly necessary for the legitimate purpose of enabling the use of a specific service explicitly requested by the subscriber or user, or for the sole purpose of carrying out the transmission of a communication over an electronic communications network.\nPreferences\nPreferences\nThe technical storage or access is necessary for the legitimate purpose of storing preferences that are not requested by the subscriber or user.\nStatistics\nStatistics\nThe technical storage or access that is used exclusively for statistical purposes.\nThe technical storage or access that is used exclusively for anonymous statistical purposes. Without a subpoena, voluntary compliance on the part of your Internet Service Provider, or additional records from a third party, information stored or retrieved for this purpose alone cannot usually be used to identify you.\nMarketing\nMarketing\nThe technical storage or access is required to create user profiles to send advertising, or to track the user on a website or across several websites for similar marketing purposes.\nManage options\nManage services\nManage {vendor_count} vendors\nRead more about these purposes\nAccept\nDeny\nView preferences\nSave preferences\nVie", "metadata": {"source": "https://www.state.gov/bureau-of-political-military-affairs/use-of-presidential-drawdown-authority-for-military-assistance-for-ukraine", "title": "Use of Presidential Drawdown Authority for Military ..."}}, {"text": "To Win Back the House, Democrats Take the Fight to Deep-Red Areas\nNew York Times To Win Back the House, Democrats Take the Fight to Deep-Red Areas\nBy Shane Goldmacher\nFeb 5, 2026, 9:27 pm 91 pts Democrats are tapping candidates with unusual résumés — a Tejano recording star, a smokejumper and a fourth-generation farmer — to compete in areas long seen as inhospitable.\nContinue reading\nTo Win Back the House, Democrats Take the Fight to Deep-Red Areas\nat\nNew York Times\nRead Article\nShare Article\nemail\ntwitter\nfacebook\npocket\nreddit\ntumblr\nlinkedin\npinterest\nTrending Today\nWoody Allen, a Florida mansion rulebook and a Paris ‘wife hunt’: stories you may have missed from the Epstein files\nThe Guardian\n169 In sticking by Trump, Republicans and rightwing evangelicals have made a devil’s pact\nThe Guardian\n166 Heritage VP of Development Clarifies That \"Declaration of Independence and Constitution are Foundational to American Exceptionalism\"\nReason\n161 Bad Bunny goes to the Super Bowl – podcast\nThe Guardian\n158 Thursday briefing: W​ill the Epstein ​files ​threaten ​Peter Mandelson’s ​legacy​?\nThe Guardian\n150 Peter Dinklage Reads A Poem Honoring Renée Nicole Good\nCrooks and Liars\n145 ‘Grind the country to a halt’: Democrat urges national strike if Trump meddles in midterms\nThe Guardian\n134 The Upshot Of The Wynn and Boasberg Complaints: The Code of Conduct Cannot Be Used To Obtain Discovery\nReason\n130\nAbout Politomix\nWelcome to Politomix -- the political news wire where left, right and center mix.\nPolitomix aggregates the day's political news on the web and your mobile device.\nPolitomix Home\nTrending\nSites\nSearch\nAbout\n2026\nGlassWave", "metadata": {"source": "https://politomix.com/nyt/2328106/to-win-back-house-democrats-take-fight-to-deep-red-areas/", "title": "To Win Back the House , Democrats Take the Fight to Deep - Red ..."}}, {"text": "Democratic Legislative Campaign Committee - Elect State Dems\nToggle High Contrast\nToggle Large Text\nElect State Dems\nEmail *\nZIP Code *\nText Me Updates\nMobile Number\nBy entering your phone number, you are consenting to receive recurring automated text messages & calls from the DLCC with news & info about our work. Message frequency varies. For SMS, message & data rates may apply. Text STOP to end. Text HELP for help.\ndlcc.org/privacy-policy/\nFlip\n$5\n$25\n$50\n$100\n$250\nOther\nIf you've saved your payment information with ActBlue Express, your donation will go through immediately.\nAbout\nAbout DLCC\nWe’re fighting to elect local Democrats, retake statehouses, and end right-wing gerrymandering across the country.\nRead More\nNews\nNews\nRELEASE: New York State Democrats Sweep Special Elections\nPress Releases\nFebruary 4, 2026\nThe New York Senate is on the DLCC’s target map as we aim to build a supermajority in 2026 WASHINGTON —  Tonight, Democrats swept state legislative special elections across both chambers in …\nRead More\nState Democrats Racked Up Historic 2025 Election Wins\nBlog\nNovember 6, 2025\nA rundown of some of the most important Tuesday night victories you haven’t heard about yet.\nRead More\nShop\nView All\nGet Your Donkey To The Polls Tote Bags\nVote Local baseball cap\nVote Your Donkey Off T-Shirt\nText DLCC to 64784\nBy entering your phone number, you are consenting to receive recurring automated text messages & calls from the DLCC with news & info about our work. For SMS, message & data rates may apply. Text STOP to end. Text HELP for help.\ndlcc.org/privacy-policy/\nDLCC 2025 Year-End IRS 8872 report\nJoin The Fight\nEmail *\nZIP Code *\nText Me Updates\nMobile Number\nBy entering your phone number, you are consenting to receive recurring automated text messages & calls from the DLCC with news & info about our work. Message frequency varies. For SMS, message & data rates may apply. Text STOP to end. Text HELP for help.\ndlcc.org/privacy-policy/\nFight\nTarget Map\nSpotlight Races\nDonate Now", "metadata": {"source": "https://www.dlcc.org/", "title": "Democratic Legislative Campaign Committee - Elect State Dems"}}]