[
  {
    "title": "At the Winter Olympics, Team USA Can’t Escape the Politics at Home",
    "link": "https://www.nytimes.com/2026/02/08/world/europe/winter-olympics-trump-us-politics.html",
    "published": "Sun, 08 Feb 2026 13:31:41 +0000",
    "summary": "Opposition to President Trump’s policies has followed the U.S. team to Italy, and athletes, coaches and American fans are facing the backlash.",
    "source": "NYT > U.S. > Politics",
    "category": "Politics"
  },
  {
    "title": "Here’s What To Know About the Los Angeles Mayor’s Race",
    "link": "https://www.nytimes.com/2026/02/08/us/los-angeles-mayor-race.html",
    "published": "Sun, 08 Feb 2026 10:02:53 +0000",
    "summary": "The week leading up to the filing deadline saw candidates dropping from the field and a surprise last-minute challenge to the incumbent mayor, Karen Bass.",
    "source": "NYT > U.S. > Politics",
    "category": "Politics"
  },
  {
    "title": "For $1 Million, Donors to U.S.A. Birthday Group Offered Access to Trump",
    "link": "https://www.nytimes.com/2026/02/08/us/politics/freedom-250-trump-donors.html",
    "published": "Sun, 08 Feb 2026 10:02:36 +0000",
    "summary": "A new organization blessed by the president is raising money for events and projects that will put a Trumpian spin on the nation’s semiquincentennial.",
    "source": "NYT > U.S. > Politics",
    "category": "Politics"
  },
  {
    "title": "Epstein Files Reveal Scope of Ghislaine Maxwell’s Role in Clinton Circle",
    "link": "https://www.nytimes.com/2026/02/08/us/politics/epstein-clintons-maxwell.html",
    "published": "Sun, 08 Feb 2026 10:01:06 +0000",
    "summary": "Jeffrey Epstein’s longtime companion helped advise on the kickoff of the Clinton Global Initiative and arranged for $1 million in funding for it, emails show.",
    "source": "NYT > U.S. > Politics",
    "category": "Politics"
  },
  {
    "title": "MAGA’s Split Over Israel Extends to a Ship Attacked 58 Years Ago",
    "link": "https://www.nytimes.com/2026/02/08/business/media/liberty-ship-attack-israel-conservatives.html",
    "published": "Sun, 08 Feb 2026 10:00:54 +0000",
    "summary": "The Israeli military killed 34 people on the U.S.S. Liberty in 1967. Whether it was an accident, as many historians believe, has become a litmus test within President Trump’s movement.",
    "source": "NYT > U.S. > Politics",
    "category": "Politics"
  },
  {
    "title": "Hearings | Senate Committee on Health, Education, Labor and ...",
    "link": "https://www.help.senate.gov/hearings",
    "published": "2026-02-08T09:56:20Z",
    "summary": "5 days ago · The 340B Program: Examining Its Growth and Impact on Patients Hearing type: Full Committee Hearing Location: 430 Dirksen Senate Office Building Date: 10/23/25 Time:10:00am Labor Law Reform Part 2: New Solutions for Finding a Pro-Worker Way Forward Hearing type: Full Committee Hearing Location: 430 Dirksen Senate Office Building Date: 10/22/25 ...",
    "source": "Web Search: latest U.S. Senate committee hearings on healthcare reform",
    "category": "Politics"
  },
  {
    "title": "Committee Schedule for the Week of February 2 - 8, 2026",
    "link": "https://www.congress.gov/committee-schedule",
    "published": "2026-02-08T09:56:20Z",
    "summary": "Committee Schedule This schedule combines announcements about future House and Senate committee meetings and hearings for the selected week. Data sources for this schedule are the House Committee Repository and Hearings & Meetings on Senate .gov. See About the Committee Schedule, Meetings and Hearings for more information.",
    "source": "Web Search: latest U.S. Senate committee hearings on healthcare reform",
    "category": "Politics"
  },
  {
    "title": "Republicans press for HSAs, ACA subsidy reform in Senate hearing",
    "link": "https://www.fiercehealthcare.com/regulatory/republicans-press-hsa-expansion-aca-subsidy-reform-senate-hearing",
    "published": "2026-02-08T09:56:20Z",
    "summary": "Nov 19, 2025 · The Affordable Care Act (ACA) has been a political football through much of its history, and the landmark healthcare law was back in the center spotlight at a hearing in the Senate on Wednesday.",
    "source": "Web Search: latest U.S. Senate committee hearings on healthcare reform",
    "category": "Politics"
  },
  {
    "title": "U.S. Senate: Hearings & Meetings",
    "link": "https://www.senate.gov/committees/hearings_meetings.htm",
    "published": "2026-02-08T09:56:20Z",
    "summary": "Published hearing transcripts contain all witness testimony, the question-and-answer portion of the hearing , and any other material requested of the witness by the committee . It may take several months, or even years, for a hearing to be published.",
    "source": "Web Search: latest U.S. Senate committee hearings on healthcare reform",
    "category": "Politics"
  },
  {
    "title": "Watch live: Senate HELP Committee weighs health care costs",
    "link": "https://thehill.com/video-clips/5429528-watch-live-senate-help-committee-health-care-costs/",
    "published": "2026-02-08T09:56:20Z",
    "summary": "Jul 31, 2025 · The Senate Health Committee is holding a hearing Thursday morning on how to lower health care costs. The hearing comes less than a month after President Trump signed the “big, beautiful bill&…",
    "source": "Web Search: latest U.S. Senate committee hearings on healthcare reform",
    "category": "Politics"
  },
  {
    "title": "Climate change - Topics | European Parliament",
    "link": "https://www.europarl.europa.eu/topics/en/topic/climate-change",
    "published": "2026-02-08T09:56:23Z",
    "summary": "The EU is doing its part to tackle global climate change . Find out about the European Parliament ’s work in turning EU commitments into concrete measures.",
    "source": "Web Search: European Parliament debates on climate change legislation",
    "category": "Politics"
  },
  {
    "title": "Climate, Eu Parliament rejects urgency procedure on -90% CO2 ...",
    "link": "https://www.eunews.it/en/2025/07/09/climate-epp-and-right-wing-parties-in-the-european-parliament-scupper-urgency-on-2040-target/",
    "published": "2026-02-08T09:56:23Z",
    "summary": "Jul 9, 2025 · The debate on the amendment to the Climate Act, introducing a 2040 target of a 90 per cent reduction in emissions compared to 1990 levels, compacts the ranks of left and right political forces, delineating a precise fracture between the two blocs in the European Parliament and shattering the old Ursula majority once again.",
    "source": "Web Search: European Parliament debates on climate change legislation",
    "category": "Politics"
  },
  {
    "title": "How does Parliament shape climate action? | Epthinktank ...",
    "link": "https://epthinktank.eu/2025/12/30/how-does-parliament-shape-climate-action/",
    "published": "2026-02-08T09:56:23Z",
    "summary": "Dec 30, 2025 · Although this increase was not as high as Parliament wanted, Parliament succeeded in including the ambition of delivering negative emissions after 2050 and establishing an independent, inter-disciplinary scientific advisory panel. The Parliament and Council reached an agreement on the European Climate Law at the end of June 2021.",
    "source": "Web Search: European Parliament debates on climate change legislation",
    "category": "Politics"
  },
  {
    "title": "European Parliament backs diluted 2040 climate targets - dw.com",
    "link": "https://www.dw.com/en/european-parliament-backs-diluted-2040-climate-targets/a-74728208",
    "published": "2026-02-08T09:56:23Z",
    "summary": "Nov 13, 2025 · Patriots for Europe, meanwhile, celebrated their rare involvement in proposed legislation that actually cleared the European Parliament . \"A major victory for workers, farmers and industry,\" the ...",
    "source": "Web Search: European Parliament debates on climate change legislation",
    "category": "Politics"
  },
  {
    "title": "Climate and energy high on the agenda in 2024 EU parliament ...",
    "link": "https://www.cleanenergywire.org/dossiers/climate-and-energy-high-agenda-2024-eu-parliament-elections",
    "published": "2026-02-08T09:56:23Z",
    "summary": "In this year's EU parliament elections, citizens from across the European Union voted to shape the bloc’s climate and energy policy in the years leading to the 2030 climate target. In the past four and a half years, the European Union has transformed key areas of its climate and energy legislation as part of the Green Deal – Europe’s strategy to become the first climate -neutral continent ...",
    "source": "Web Search: European Parliament debates on climate change legislation",
    "category": "Politics"
  },
  {
    "title": "Brazil's Supreme Court votes to affirm Indigenous land rights ...",
    "link": "https://www.reuters.com/world/brazil-supreme-court-affirms-indigenous-land-rights-defying-congress-2025-12-17/",
    "published": "2026-02-08T09:56:27Z",
    "summary": "Dec 17, 2025 · A majority of Brazil's Supreme Court reaffirmed protections for Indigenous land rights on Wednesday, curbing attempts by Congress to limit the recognition of reservations in a ruling likely to ...",
    "source": "Web Search: Brazil's Supreme Court ruling on indigenous land rights",
    "category": "Politics"
  },
  {
    "title": "Brazil Supreme Court strikes down Indigenous land time-limit ...",
    "link": "https://www.courthousenews.com/brazil-supreme-court-strikes-down-indigenous-land-time-limit-doctrine-for-second-time/",
    "published": "2026-02-08T09:56:27Z",
    "summary": "Dec 18, 2025 · Lawmakers sought, with a law passed after the Supreme Court 's first ruling , to entrench the policy through a constitutional amendment. Marília Marasciulo / December 18, 2025 Indigenous people celebrate after a majority of Supreme Court justices ruled to enshrine their land rights in a landmark case in Brasilia, Brazil , Thursday, Sept. 21, 2023.",
    "source": "Web Search: Brazil's Supreme Court ruling on indigenous land rights",
    "category": "Politics"
  },
  {
    "title": "Brazil: Supreme court ruling in favour of ancestral land rights",
    "link": "https://www.ohchr.org/en/press-briefing-notes/2023/09/brazil-supreme-court-ruling-favour-ancestral-land-rights",
    "published": "2026-02-08T09:56:27Z",
    "summary": "Sep 26, 2023 · A recent Brazilian Supreme Court ruling in favour of a case brought by Indigenous Peoples to reject time restrictions on claiming rights to their ancestral land is very encouraging.",
    "source": "Web Search: Brazil's Supreme Court ruling on indigenous land rights",
    "category": "Politics"
  },
  {
    "title": "Indigenous people in Brazil shed tears of joy as the Supreme ...",
    "link": "https://apnews.com/article/brazil-indigenous-groups-land-rights-supreme-court-715fc33861a5d9b3c6ee98a8362d802f",
    "published": "2026-02-08T09:56:27Z",
    "summary": "An Indigenous woman celebrates a Supreme Court ruling to enshrine Indigenous land rights , in Brasilia, Brazil , Thursday, Sept. 21, 2023. Six of the 11 Supreme Court justices voted against establishing a cut-off date after which Indigenous peoples could not claim new territory.",
    "source": "Web Search: Brazil's Supreme Court ruling on indigenous land rights",
    "category": "Politics"
  },
  {
    "title": "Brazil Decides in Landmark Court Case to Grant Land Rights to ...",
    "link": "https://sites.uab.edu/humanrights/2024/02/19/brazil-decides-in-landmark-court-case-to-grant-land-rights-to-indigenous/",
    "published": "2026-02-08T09:56:27Z",
    "summary": "Feb 19, 2024 · A jubilant celebration of color erupted as several indigenous leaders and activists gathered outside the courthouse adorned in tribal wear and brilliant headdresses to rejoice in the top court ’s decision to rule in favor of their land rights . Dubbed the “trial of the century,” Brazil’s Supreme Court decided against a so-called cutoff date restricting Indigenous people’s claims to ...",
    "source": "Web Search: Brazil's Supreme Court ruling on indigenous land rights",
    "category": "Politics"
  },
  {
    "title": "Policy Speech by Prime Minister TAKAICHI Sanae to the 219th ...",
    "link": "https://japan.kantei.go.jp/104/statement/202510/24shoshinhyomei.html",
    "published": "2026-02-08T09:56:28Z",
    "summary": "Oct 24, 2025 · The Japan -U.S. Alliance is the cornerstone of Japan's diplomacy and security policies. By firmly coordinating our efforts to address the challenges faced by both Japan and the United States, we will further reinforce the deterrence and the response capabilities of the Japan -U.S. Alliance.",
    "source": "Web Search: Japan's new prime minister's first foreign policy address",
    "category": "Politics"
  },
  {
    "title": "Japan's new PM delivers first policy address, showing 'shift ...",
    "link": "https://www.globaltimes.cn/page/202510/1346478.shtml",
    "published": "2026-02-08T09:56:28Z",
    "summary": "Oct 24, 2025 · Looking through the new Japanese prime minister's first policy address , regarding the future trajectory of China- Japan relations, key questions remain: Will she continue the policy approach of ...",
    "source": "Web Search: Japan's new prime minister's first foreign policy address",
    "category": "Politics"
  },
  {
    "title": "Japan's new Prime Minister Takaichi promises to further push ...",
    "link": "https://apnews.com/article/japan-takaichi-politics-policy-defense-4b885276a0052297ab633bac31715254",
    "published": "2026-02-08T09:56:28Z",
    "summary": "Japanese Prime Minister Sanae Takaichi, in her first major policy speech on Friday, pledged to further accelerate Japan’s military buildup and spending, and an early upgrading of the country's security strategy to allow more offensive roles and arms exports as tensions rise with China, North Korea a",
    "source": "Web Search: Japan's new prime minister's first foreign policy address",
    "category": "Politics"
  },
  {
    "title": "New Japanese Prime Minister Takaichi Lays Out Policy Approach ...",
    "link": "https://japannews.yomiuri.co.jp/politics/politics-government/20251025-288600/",
    "published": "2026-02-08T09:56:28Z",
    "summary": "Oct 25, 2025 · The new Japanese Prime Minister Takaichi outlines key policies and approaches in a major speech, addressing national priorities and future governance strategies.",
    "source": "Web Search: Japan's new prime minister's first foreign policy address",
    "category": "Politics"
  },
  {
    "title": "The First Policy Speech by Prime Minister ISHIBA Shigeru",
    "link": "https://www.japan.go.jp/kizuna/2024/11/the_first_policy_speech_by_ishiba.html",
    "published": "2026-02-08T09:56:28Z",
    "summary": "Oct 4, 2024 · Japan’s new Prime Minister ISHIBA Shigeru delivered his first policy speech, outlining key initiatives for national security, economic growth and more.",
    "source": "Web Search: Japan's new prime minister's first foreign policy address",
    "category": "Politics"
  },
  {
    "title": "Expropriation Act, 2024 - Wikipedia",
    "link": "https://en.wikipedia.org/wiki/Expropriation_Act,_2024",
    "published": "2026-02-08T09:56:30Z",
    "summary": "The Expropriation Act, 2024 (Act No. 13 of 2024) is an act of the Parliament of South Africa that establishes the framework for compulsory property acquisition by South African government entities. The Act envisages the repeal of the apartheid-era Expropriation Act, 1975 and will come into operation on a date determined by the President by proclamation in the Government Gazette. The Act has ...",
    "source": "Web Search: South Africa's parliamentary vote on land expropriation bill",
    "category": "Politics"
  },
  {
    "title": "Cyril Ramaphosa signs expropriation bill in South Africa President Cyril Ramaphosa assents to Expropriation Bill The implications of the Expropriation Bill for South Africa’s ... Expropriation Act, 2024 - Wikipedia Amendment of Section 25 of the Constitution - Parliament South Africa’s Expropriation Bill Signed into Law – What It ... The implications of the Expropriation Bill for South Africa ’ s Land South Africa ' s Land Expropriation Bill Passed By Parliament South Africa ' s Land Expropriation Bill Passed By Parliament South Africa ' s Land Expropriation Bill Passed By Parliament South Africa's Land Expropriation Bill Passed By Parliament",
    "link": "https://www.bbc.com/news/articles/cvg9w4n6gp5o",
    "published": "2026-02-08T09:56:30Z",
    "summary": "Jan 24, 2025 · It says that while it supports legislation addressing land restitution, it takes issue with the process followed by the country's parliament to enact this law. Jan 23, 2025 · President Cyril Ramaphosa has signed into law the Expropriation Bill which repeals the pre-democratic Expropriation Act of 1975 and sets out how organs of State may expropriate land in the public interest for varied reasons. The Bill , which has undergone a five-year process of public consultation and parliamentary deliberation, aligns legislation on expropriation with the Constitution. Jan 29, 2025 · On January 23, 2025, President Cyril Ramaphosa signed the Expropriation Bill into law, marking a significant milestone in South Africa’s ongoing struggle with land reform. This legislation aims ... The Expropriation Act, 2024 (Act No. 13 of 2024) is an act of the Parliament of South Africa that establishes the framework for compulsory property acquisition by South African government entities. The Act envisages the repeal of the apartheid-era Expropriation Act, 1975 and will come into operation on a date determined by the President by proclamation in the Government Gazette. The Act has ... What are the current recommendations of the Joint CRC? Recommendation 1: Section 25 of the Constitution must be amended and be clear about the expropriation of land and property without compensation. This will address historic wrongs of land dispossession, ensure fair access to land and empower the majority of South Africans. Feb 7, 2025 · The signing of the Expropriation Bill by President Cyril Ramaphosa on 24 January 2025 has reignited debates over land reform, property rights, and economic stability in South Africa . While supporters argue that the law is a necessary tool to correct historical injustices, critics see it as a threat to private property rights and investor confidence. The bill has been in development for years ... When did the expropriation bill become law in South Africa? By Nco Dube On January 23, 2025 , President Cyril Ramaphosa signed the Expropriation Bill into law, marking a significant milestone in South Africa’s ongoing struggle with land reform. What is the South African land reform bill? The Bill is a review of the Expropriation Act 63 of 1975 emanating from a Cabinet approval of September 15, 2004. The government has said the expropriation of land and land reform in South Africa has been a contentious issue and has necessitated a review of current expropriation laws. Why is South Africa reviewing its expropriation laws? The government has said the expropriation of land and land reform in South Africa has been a contentious issue and has necessitated a review of current expropriation laws. The government has said the main objective of the bill is to ensure that expropriation laws are in line with the Constitution of South Africa . Will South Africa's land expropriation bill arbitrarily seize land from private owners? South Africa's Land Expropriation Bill Passed By Parliament Public Works and Infrastructure Minister, Patricia de Lille, has moved to assure South Africans that government has no intention of using the Expropriation Bill to arbitrarily seize land from private owners. Sep 29, 2022 · The government has said the main objective of the bill is to ensure that expropriation laws are in line with the Constitution of South Africa .",
    "source": "Web Search: South Africa's parliamentary vote on land expropriation bill",
    "category": "Politics"
  },
  {
    "title": "President Cyril Ramaphosa assents to Expropriation Bill",
    "link": "https://www.gov.za/news/media-statements/president-cyril-ramaphosa-assents-expropriation-bill-23-jan-2025",
    "published": "2026-02-08T09:56:30Z",
    "summary": "Jan 23, 2025 · President Cyril Ramaphosa has signed into law the Expropriation Bill which repeals the pre-democratic Expropriation Act of 1975 and sets out how organs of State may expropriate land in the public interest for varied reasons. The Bill , which has undergone a five-year process of public consultation and parliamentary deliberation, aligns legislation on expropriation with the Constitution.",
    "source": "Web Search: South Africa's parliamentary vote on land expropriation bill",
    "category": "Politics"
  },
  {
    "title": "The implications of the Expropriation Bill for South Africa’s ...",
    "link": "https://www.iol.co.za/sunday-tribune/2025-01-29-the-implications-of-the-expropriation-bill-for-south-africas-land-reform-agenda/",
    "published": "2026-02-08T09:56:30Z",
    "summary": "Jan 29, 2025 · On January 23, 2025, President Cyril Ramaphosa signed the Expropriation Bill into law, marking a significant milestone in South Africa’s ongoing struggle with land reform. This legislation aims ...",
    "source": "Web Search: South Africa's parliamentary vote on land expropriation bill",
    "category": "Politics"
  },
  {
    "title": "South Africa’s Expropriation Bill Signed into Law – What It ...",
    "link": "https://vdm.law/media/articles/entryid/73/south-africas-expropriation-bill-signed-into-law-what-it-means",
    "published": "2026-02-08T09:56:30Z",
    "summary": "Feb 7, 2025 · The signing of the Expropriation Bill by President Cyril Ramaphosa on 24 January 2025 has reignited debates over land reform, property rights, and economic stability in South Africa . While supporters argue that the law is a necessary tool to correct historical injustices, critics see it as a threat to private property rights and investor confidence. The bill has been in development for years ...",
    "source": "Web Search: South Africa's parliamentary vote on land expropriation bill",
    "category": "Politics"
  }
]