[
  {
    "title": "TrumpRx: What to Know About Insurance Benefits, Pricing and Savings",
    "link": "https://www.nytimes.com/2026/02/06/health/trumprx-prescription-drug-prices-consumers.html",
    "published": "Fri, 06 Feb 2026 18:18:55 +0000",
    "summary": "People may be able to pay less for prescriptions with their insurance rather than via the new government website. The Trump drugstore is meant to help people buy medications using their own money.",
    "source": "NYT > Health",
    "category": "Health"
  },
  {
    "title": "Federal Vaccine Advisers Take Aim at Covid Shots",
    "link": "https://www.nytimes.com/2026/02/06/health/vaccines-covid-acip-malone-kennedy.html",
    "published": "Fri, 06 Feb 2026 15:00:07 +0000",
    "summary": "One panelist accused the F.D.A. of withholding data on potential harms. The advisers also are reviewing research on vaccines given to pregnant women.",
    "source": "NYT > Health",
    "category": "Health"
  },
  {
    "title": "TrumpRx, the President’s Online Drugstore, Opens for Business",
    "link": "https://www.nytimes.com/2026/02/05/health/trumprx-online-drugstore-prices.html",
    "published": "Fri, 06 Feb 2026 22:13:15 +0000",
    "summary": "TrumpRx is aimed at helping patients use their own money to buy medicines. But researchers who study drug pricing warned that many patients could pay too much if they use the site.",
    "source": "NYT > Health",
    "category": "Health"
  },
  {
    "title": "Nancy Guthrie Kidnapping Shows Limits of Tracking Pacemakers in Police Work",
    "link": "https://www.nytimes.com/2026/02/05/health/savannah-guthrie-mom-nancy-missing-pacemaker.html",
    "published": "Thu, 05 Feb 2026 22:22:49 +0000",
    "summary": "The heart devices do not track location, nor do they transmit across large distances.",
    "source": "NYT > Health",
    "category": "Health"
  },
  {
    "title": "F.T.C. Settles With Express Scripts Over High Insulin Prices",
    "link": "https://www.nytimes.com/2026/02/04/health/insulin-prices-express-scripts-ftc.html",
    "published": "Wed, 04 Feb 2026 21:40:28 +0000",
    "summary": "The Trump administration announced that the company, a pharmacy benefit manager, had agreed to make significant changes to its practices.",
    "source": "NYT > Health",
    "category": "Health"
  },
  {
    "title": "New 'Stratus' COVID Variant Dominant in US: Know These Symptoms",
    "link": "https://www.today.com/health/coronavirus/stratus-covid-variant-symptoms-rcna224723",
    "published": "2026-02-07T21:05:33Z",
    "summary": "Aug 13, 2025 · COVID-19 cases are rising across U.S. as the country faces a late summer wave driven by the new XFG variant , aka \"Stratus.\" Here's what to know about symptoms and vaccines.",
    "source": "Web Search: new COVID-19 variant symptoms and transmission rates",
    "category": "Health"
  },
  {
    "title": "New ‘Stratus’ COVID-19 Variant: Symptoms, Risks, and What to Know The dominant COVID-19 variant: what you should know COVID variant NB.1.8.1 hits U.S. What to know about symptoms ... Map Shows Rising COVID Cases as Stratus Variant Spreads New COVID-19 Variant 'Stratus' Dominant In US: What We Know ... Variants and Genomic Surveillance | COVID-19 | CDC",
    "link": "https://www.healthline.com/health-news/covid-19-symptoms-usually-show-up-in-this-order",
    "published": "2026-02-07T21:05:33Z",
    "summary": "• COVID - 19 cases are rising as the JN.1 “Pirola” variant accounts for 40% of cases worldwide. •Respiratory virus season is in full swing in the Northern Hemisphere with COVID - 19 , the flu, and RSV illnesses circulating widely. •Understanding how COVID - 19 symptoms present can help minimize spread and help you get the right treatment. •Prior research has determined that COVID - 19 symptoms often start in a certain order. •While influenza typically begins with a cough, the first symptom of COVID - 19 is generally fever, though symptoms may vary. A winter surge COVID - 19 cases may have you wondering whether it’s time to mask up again or get vaccinated or boosted to protect yourself from getting sick. See full list on healthline.com According to Dr. Monica Gandhi, MPH, professor of medicine at the University of California, San Francisco, symptoms of new COVID variants are similar to symptoms associated with other SARS-CoV-2 strains. “There is no evidence that the symptoms caused by [ new variants] differ from the symptoms caused by other Omicron subvariants,” Gandhi said. “The symptoms seem to be the same as with other recent subvariants of Omicron.” Like other subvariants, Pirola symptoms may include upper respiratory tract symptoms such as: •fever •coughing •sneezing See full list on healthline.com A 2020 study from the University of Southern California (USC) shed light on how COVID - 19 symptoms present, which may help individuals recognize whether their cough is just a cough or something worse. The researchers determined that COVID - 19 symptoms often start in a certain order: 1.fever 2.cough 3.sore throat, muscle pain, or headache 4.nausea or vomiting 5.diarrhea See full list on healthline.com “It’s critically important to understand the progression of symptoms of people with the COVID - 19 infection so you stop the spread of the disease — in effect, isolate and then initiate effective contact tracing,” Glatter said. “This is quite relevant for a virus that is 2 to 3 times more transmissible than influenza, leading to outbreaks in clusters.” He added that understanding the first symptoms not only helps patients seek testing more rapidly, but also to begin physically distancing themselves after the first symptoms begin. “It also underscores the importance of wearing masks and hand hygiene upon learning of symptoms ,” Glatter said. See full list on healthline.com In Glatter’s experience treating patients with COVID - 19 in New York City, symptoms associated with the virus may be more varied than the USC study suggests. “In general, while fever is usually the most commonly described initial symptom of COVID - 19 infection, the reality of what I see on the front lines is more variable,” Glatter said. “In fact, some patients may present only with loss of taste or smell and otherwise feel well.” Glatter added that he’s seen COVID - 19 symptoms ranging from “ COVID -toes” (chilblains) to reddish-blue discoloration of skin in response to acute inflammation, all in the absence of fever, cough, or other respiratory symptoms . He said that other patients have also “presented with malaise, headache, and dizziness,” which in some ways resemble stroke symptoms but without fever, cough, or any evidence of upper respiratory symptoms . “I have also seen patients present only with chest pain, devoid of any respiratory symptoms ,” Glatter said. “The onset of nausea, vomiting, and diarrhea after onset of respiratory symptoms such as fever and cough may also suggest that a person may have COVID - 19 .” According to Glatter, healthcare professionals need to be vigilant and keep an open mind when evaluating patients who may have symptoms associated with COVID - 19 — particularly as new subvariants emerge. See full list on healthline.com If you’re wondering whether it’s time to mask up again, experts are not particularly concerned about the new variants, particularly for vaccinated individuals. The updated COVID - 19 boosters should continue to offer protection against severe illness from the new variants. The WHO recommends COVID - 19 booster shots for sensitive groups, particularly immunocompromised individuals, people with multiple comorbidities, and those who are older than 65. “I am not very concerned about the new variant because COVID - 19 is not an eradicable virus (it is found in too many animal reservoirs for one thing, with rapid evolution in animals such as deer) so we will always see new subvariants,” Gandhi said. “However, we have high rates of population immunity in the United States at this time (up to 96.4% antibody positivity as of fall of 2022). Memory B cells — generated by the vaccines or as a result of a prior infection — have been shown to recognize the virus, including its variants. Specifically, if memory B cells see a variant , they are able to make antibodies adapted to the variant or subvariant,” she added. Gandhi explained that both COVID - 19 vaccines and natural infection trigger the production of T cells. See full list on healthline.com JN.1, nicknamed “Pirola,” is the dominant SARS-CoV-2 strain in the U.S. and globally. Symptoms of the JN.1 Pirola variant may present similarly to prior Omicron subvariants. Understanding the difference between COVID - 19 symptoms and flu or RSV symptoms could be helpful in minimizing spread and getting the right treatment. A 2020 study compared symptoms from people who had the flu versus COVID - 19 and found that COVID - 19 symptoms occur in a particular order. Experts with frontline experience emphasize that this progression isn’t always how the disease manifests, but it’s still a useful guide for healthcare professionals. See full list on healthline.com Sep 30, 2025 · COVID-19 is getting around, causing sore throats, congestion and coughing. The current dominant strain of COVID-19 is the Stratus variant also called XFG. It stems from the omicron strain of COVID-19 , which was identified in 2021. Symptoms of the newest COVID variant The symptoms of the XFG COVID-19 strain are similar to previous strains. May 27, 2025 · Cases of the new COVID-19 variant NB.1.8.1, linked to a large surge in China, have been detected in multiple locations across the United States, according to the Centers for Disease Control and ... Aug 27, 2025 · New cases of COVID-19 are increasing nationwide, fueled by the Stratus variant , an emerging offshoot of the Omicron variant . According to the Centers for Disease Control and Prevention (CDC), the ... Oct 3, 2025 · The symptoms of XFG are similar to those of other Omicron sub-variants A highly transmissible COVID-19 strain is driving a surge of infections across the United States. Nicknamed 'Stratus,' the ... Aug 28, 2025 · Monitoring variant proportions SARS-CoV-2, the virus that causes COVID-19 , is constantly accumulating mutations in its genetic sequence over time. These mutations can result in new variants with different traits. New variants of SARS-CoV-2 are expected to continue to emerge.",
    "source": "Web Search: new COVID-19 variant symptoms and transmission rates",
    "category": "Health"
  },
  {
    "title": "The dominant COVID-19 variant: what you should know",
    "link": "https://health.osu.edu/health/virus-and-infection/know-about-dominant-covid-variant",
    "published": "2026-02-07T21:05:33Z",
    "summary": "Sep 30, 2025 · COVID-19 is getting around, causing sore throats, congestion and coughing. The current dominant strain of COVID-19 is the Stratus variant also called XFG. It stems from the omicron strain of COVID-19 , which was identified in 2021. Symptoms of the newest COVID variant The symptoms of the XFG COVID-19 strain are similar to previous strains.",
    "source": "Web Search: new COVID-19 variant symptoms and transmission rates",
    "category": "Health"
  },
  {
    "title": "COVID variant NB.1.8.1 hits U.S. What to know about symptoms ...",
    "link": "https://www.cbsnews.com/news/covid-variant-nb-1-8-1-symptoms-booster-vaccine/",
    "published": "2026-02-07T21:05:33Z",
    "summary": "May 27, 2025 · Cases of the new COVID-19 variant NB.1.8.1, linked to a large surge in China, have been detected in multiple locations across the United States, according to the Centers for Disease Control and ...",
    "source": "Web Search: new COVID-19 variant symptoms and transmission rates",
    "category": "Health"
  },
  {
    "title": "Map Shows Rising COVID Cases as Stratus Variant Spreads",
    "link": "https://www.newsweek.com/stratus-variant-covid-symptoms-cases-map-2119991",
    "published": "2026-02-07T21:05:33Z",
    "summary": "Aug 27, 2025 · New cases of COVID-19 are increasing nationwide, fueled by the Stratus variant , an emerging offshoot of the Omicron variant . According to the Centers for Disease Control and Prevention (CDC), the ...",
    "source": "Web Search: new COVID-19 variant symptoms and transmission rates",
    "category": "Health"
  },
  {
    "title": "An Alzheimer’s breakthrough 10 years in the making",
    "link": "https://news.harvard.edu/gazette/story/2026/01/an-alzheimers-breakthrough-10-years-in-the-making/",
    "published": "2026-02-07T21:05:34Z",
    "summary": "Jan 27, 2026 · “People who have loved ones with Alzheimer’s understandably have difficulty waiting for the results of clinical trials , which by their nature, take a long time,” he said. “But our method of going from the laboratory to the clinical trial has been validated many times.",
    "source": "Web Search: breakthrough Alzheimer's treatment clinical trial results",
    "category": "Health"
  },
  {
    "title": "2025 Breakthroughs in Alzheimer’s Disease - medcentral.com",
    "link": "https://www.medcentral.com/neurology/dementia/2025-breakthroughs-in-alzheimers-disease",
    "published": "2026-02-07T21:05:34Z",
    "summary": "Dec 17, 2025 · From 2002 through 2012, the failure rate for clinical trials of Alzheimer’s disease was 99.6%. 1 Despite this stunning statistic, there has fortunately been a bevy of significant research breakthroughs since then, resulting in a whole new approach to Alzheimer’s prevention, diagnosis, and treatment . A survey of these developments not only shows us how far we’ve come in our understanding ...",
    "source": "Web Search: breakthrough Alzheimer's treatment clinical trial results",
    "category": "Health"
  },
  {
    "title": "The next big breakthroughs in Alzheimer’s science and treatment",
    "link": "https://www.universityofcalifornia.edu/news/next-big-breakthroughs-alzheimers-science-and-treatment",
    "published": "2026-02-07T21:05:34Z",
    "summary": "Dec 4, 2025 · The next big breakthroughs in Alzheimer’s science and treatment The outlook for dementia care is changing fast. UC experts explain what that means for patients and families, and what it will take to keep the momentum growing.",
    "source": "Web Search: breakthrough Alzheimer's treatment clinical trial results",
    "category": "Health"
  },
  {
    "title": "Reversing Alzheimer's damage: Two cancer drugs demonstrate ...",
    "link": "https://www.sciencedaily.com/releases/2025/07/250730030402.htm",
    "published": "2026-02-07T21:05:34Z",
    "summary": "Jul 31, 2025 · In an exciting breakthrough , researchers have identified cancer drugs that might reverse the effects of Alzheimer 's disease in the brain. By analyzing gene expression in brain cells, they ...",
    "source": "Web Search: breakthrough Alzheimer's treatment clinical trial results",
    "category": "Health"
  },
  {
    "title": "Breakthrough in treating Alzheimer’s using targeted drug ...",
    "link": "https://wvumedicine.org/news-feed/news-article/WVU-Medicine/Front-Page/breakthrough-in-treating-alzheimer-s-using-targeted-drug-delivery-reported-in-new-england-journal-of-medicine/",
    "published": "2026-02-07T21:05:34Z",
    "summary": "Jan 3, 2024 · A potential advancement in the treatment of Alzheimer’s disease was announced today by researchers at the West Virginia University Rockefeller Neuroscience Institute (RNI). A first in-human study, featured in the latest issue of the New England Journal of Medicine, demonstrates that focused ultrasound in combination with anti-amyloid-beta monoclonal antibody treatment can accelerate the ...",
    "source": "Web Search: breakthrough Alzheimer's treatment clinical trial results",
    "category": "Health"
  },
  {
    "title": "Many blame social media for poor mental health among teenagers ...",
    "link": "https://www.abc.net.au/news/2024-06-02/is-social-media-facebook-instagram-linked-to-teen-mental-health/103838726",
    "published": "2026-02-07T21:05:35Z",
    "summary": "What's next? Scientists want social media giants to share their internal data on how their products affect teenagers ' mental health . If Jordy had a switch to instantly shut down social media , she would flip it.",
    "source": "Web Search: mental health impact of social media on teenagers 2024",
    "category": "Health"
  },
  {
    "title": "Anxiety, loneliness and Fear of Missing Out: The impact of social ...",
    "link": "https://www.centreformentalhealth.org.uk/anxiety-loneliness-and-fear-missing-out-impact-social-media-young-peoples-mental-health/",
    "published": "2026-02-07T21:05:35Z",
    "summary": "The evidence suggests that social media use is strongly associated with anxiety, loneliness and depression. Whether it is causal or just a correlation will need to be further examined by researchers, mental health policy stakeholders and the social media industry.",
    "source": "Web Search: mental health impact of social media on teenagers 2024",
    "category": "Health"
  },
  {
    "title": "Examining the Effects of Social Media on Mental Health Among...",
    "link": "https://pubmed.ncbi.nlm.nih.gov/38435934/",
    "published": "2026-02-07T21:05:35Z",
    "summary": "The impact of social media on the mental well-being of adolescents has emerged as an escalating concern.Advocating for the creation of technology-free zones and fostering in-person friendships among teens could be a beneficial approach that policymakers should support.",
    "source": "Web Search: mental health impact of social media on teenagers 2024",
    "category": "Health"
  },
  {
    "title": "The Impact of Social Media on Teen Mental Health ! | Medium",
    "link": "https://prerana-pant.medium.com/the-impact-of-social-media-on-teen-mental-health-67e727f28c23",
    "published": "2026-02-07T21:05:35Z",
    "summary": "While social media has its benefits, the negative impacts on teen mental health are increasingly coming to light: Comparison and Low Self-Esteem: Social media is a highlight reel of others’ lives, often showcasing only the positive moments.",
    "source": "Web Search: mental health impact of social media on teenagers 2024",
    "category": "Health"
  },
  {
    "title": "Social Media 's Impact on Gen Z's Mental Health | Sandstone",
    "link": "https://www.sandstonecare.com/news/the-impact-of-social-media-on-the-mental-health-of-gen-z/",
    "published": "2026-02-07T21:05:35Z",
    "summary": "Read about how social media impacts Gen Z's mental health , leading to anxiety and depression, and learn effective strategies to reduce its negative impact .The Impact of Social Media on the Mental Health of Gen Z. Updated 08 March 2024 .",
    "source": "Web Search: mental health impact of social media on teenagers 2024",
    "category": "Health"
  },
  {
    "title": "FDA signs off on 1st gene therapy for rare genetic disease",
    "link": "https://www.fiercepharma.com/pharma/italian-non-profit-fondazione-telethon-lands-fda-approval-first-gene-therapy-treat-rare",
    "published": "2026-02-07T21:05:37Z",
    "summary": "Dec 10, 2025 · The FDA has issued its stamp of approval to a new, cell-based option to treat Wiskott-Aldrich syndrome (WAS), marking the first therapy of its kind for the rare disease and making Italy’s ...",
    "source": "Web Search: FDA approval of gene therapy for rare genetic disorders",
    "category": "Health"
  },
  {
    "title": "FDA unveils new pathway to speed custom gene editing therapies",
    "link": "https://www.fiercebiotech.com/biotech/fdas-new-plausible-mechanism-pathway-accelerate-bespoke-gene-editing-therapies",
    "published": "2026-02-07T21:05:37Z",
    "summary": "Nov 12, 2025 · The investigational therapy is meant for a rare indication with a high unmet need and is designed to target the defined biological cause of the disease , namely, to silence the HTT gene .",
    "source": "Web Search: FDA approval of gene therapy for rare genetic disorders",
    "category": "Health"
  },
  {
    "title": "Nonprofit wins FDA approval for rare disease gene therapy, in ...",
    "link": "https://www.statnews.com/2025/12/10/nonprofit-telethon-wins-fda-approval-gene-therapy-waskyra/",
    "published": "2026-02-07T21:05:37Z",
    "summary": "Dec 10, 2025 · The FDA has granted approval to a new gene therapy for a rare immune disorder , the maker of which is notably not a drug company, but an Italian charity.",
    "source": "Web Search: FDA approval of gene therapy for rare genetic disorders",
    "category": "Health"
  },
  {
    "title": "Gene Therapy in Rare Genetic Disorders: Current Progress and ...",
    "link": "https://pmc.ncbi.nlm.nih.gov/articles/PMC12606653/",
    "published": "2026-02-07T21:05:37Z",
    "summary": "FDA - approved gene therapies and their cost. Approval processes for gene therapies are stringent and resource-intensive, with high compliance standards. Post- approval , administering these therapies demands skilled professionals and often specialized healthcare settings. Many gene therapies target rare genetic disorders , meaning fewer patients contribute to covering the costs, unlike drugs for ...",
    "source": "Web Search: FDA approval of gene therapy for rare genetic disorders",
    "category": "Health"
  },
  {
    "title": "FDA Flexibility Leads to First Approved Gene Therapy for Rare ...",
    "link": "https://medcitynews.com/2025/12/gene-therapy-rare-disease-wiskott-aldrich-syndrome-fondazione-telethon-waskyra-fda-approval/",
    "published": "2026-02-07T21:05:37Z",
    "summary": "Dec 10, 2025 · A genetic disorder that leads to bleeding episodes and life-threatening infections has a new FDA approved treatment, a regulatory decision that marks two notable firsts — the first gene therapy ...",
    "source": "Web Search: FDA approval of gene therapy for rare genetic disorders",
    "category": "Health"
  },
  {
    "title": "Antimicrobial resistance - Wikipedia",
    "link": "https://en.wikipedia.org/wiki/Antimicrobial_resistance",
    "published": "2026-02-07T21:05:39Z",
    "summary": "Antibiotic resistance tests: Bacteria are streaked on solid medium in Petri dishes and paper disks are laid on the surface, each impregnated with a different antibiotic.",
    "source": "Web Search: rising cases of antibiotic-resistant infections in hospitals",
    "category": "Health"
  },
  {
    "title": "Surge in Antibiotic - Resistant Infections in the U.S.",
    "link": "https://www.berkeywaterfilter.com/surge-in-antibiotic-resistant-infections-in-the-u-s/",
    "published": "2026-02-07T21:05:39Z",
    "summary": "The CDC emphasizes that the rise in antibiotic - resistant infections is linked to the overuse and misuse of antibiotics in both healthcare and agricultural settings. As bacteria evolve and develop resistance, common infections become more difficult to treat, leading to longer hospital ...",
    "source": "Web Search: rising cases of antibiotic-resistant infections in hospitals",
    "category": "Health"
  },
  {
    "title": "\"Inappropriate prescribing\" of antibiotics causing infections in Hospi...",
    "link": "https://www.bailiwickexpress.com/news/inappropriate-prescribing-of-antibiotics-causing-infections-in-hospital/",
    "published": "2026-02-07T21:05:39Z",
    "summary": "The Hospital has seen a rise in antibiotic - resistant infections caused by inappropriately-prescribed antibiotics, it has emerged.",
    "source": "Web Search: rising cases of antibiotic-resistant infections in hospitals",
    "category": "Health"
  },
  {
    "title": "Rising Antibiotic - Resistant Infections Hospital Concerns - Amalis...",
    "link": "https://amalislam.com/rising-antibiotic-resistant-infections-hospital-concerns/",
    "published": "2026-02-07T21:05:39Z",
    "summary": "The rise of antibiotic - resistant infections can be attributed to various factors, including overuse and misuse of antibiotics , inadequate infection control measures, and the natural evolution of bacteria.Read more about Surge in cases of antibiotic - resistant infections in hospitals .",
    "source": "Web Search: rising cases of antibiotic-resistant infections in hospitals",
    "category": "Health"
  },
  {
    "title": "Antibiotic - resistant bacteria on the rise in Brazilian hospitals",
    "link": "https://revistapesquisa.fapesp.br/en/antibiotic-resistant-bacteria-on-the-rise-in-brazilian-hospitals/",
    "published": "2026-02-07T21:05:39Z",
    "summary": "For Anna Levin, an infectious disease specialist from USP and head of the monitoring project mentioned at the beginning of this report, hospital infections caused by antibiotic - resistant bacteria reflect the quality of care.",
    "source": "Web Search: rising cases of antibiotic-resistant infections in hospitals",
    "category": "Health"
  }
]