[
  {
    "title": "Reaction to Trump’s Racist Post Shows He Is Not Always Immune to Politics",
    "link": "https://www.nytimes.com/2026/02/07/us/politics/trump-social-post-reaction.html",
    "published": "Sun, 08 Feb 2026 01:39:12 +0000",
    "summary": "With the midterm elections nearing, President Trump has found himself in the uncomfortable position of backtracking, even if only by degrees, at key moments.",
    "source": "NYT > U.S. News",
    "category": "U.S."
  },
  {
    "title": "Savannah Guthrie, in New Video Message, Promises to Pay for Return of Her Mother",
    "link": "https://www.nytimes.com/2026/02/07/us/savannah-guthrie-nancy-guthrie-video-message.html",
    "published": "Sun, 08 Feb 2026 02:01:40 +0000",
    "summary": "The “Today” show anchor, in a message on social media with her siblings, said the return of their mother Nancy “is the only way we will have peace.”",
    "source": "NYT > U.S. News",
    "category": "U.S."
  },
  {
    "title": "Man Pleads Guilty to Arson in 2019 Attack on Tennessee Civil Rights Center",
    "link": "https://www.nytimes.com/2026/02/07/us/tennessee-arson-guilty-plea-landmark.html",
    "published": "Sun, 08 Feb 2026 00:34:49 +0000",
    "summary": "The man also pleaded guilty this week to a charge of attempting to provide material support to a foreign terrorist organization, Hezbollah.",
    "source": "NYT > U.S. News",
    "category": "U.S."
  },
  {
    "title": "A Month After Renee Good’s Killing, Her Partner Makes First Public Appearance at Memorial",
    "link": "https://www.nytimes.com/2026/02/07/us/renee-good-partner-memorial-minneapolis.html",
    "published": "Sun, 08 Feb 2026 01:58:07 +0000",
    "summary": "Becca Good attended a memorial for Renee Good, offering words of compassion and resilience to the crowd gathered in a snow-covered Minneapolis park.",
    "source": "NYT > U.S. News",
    "category": "U.S."
  },
  {
    "title": "Thousands in Mississippi Remain Without Power Two Weeks After Winter Storm",
    "link": "https://www.nytimes.com/2026/02/07/us/mississippi-power-outages-winter-storm.html",
    "published": "Sat, 07 Feb 2026 22:12:39 +0000",
    "summary": "A majority of those who lost service have had their power restored. But thousands in more rural areas remain in darkness, according to a local utility.",
    "source": "NYT > U.S. News",
    "category": "U.S."
  },
  {
    "title": "Trump v. United States - Wikipedia",
    "link": "https://en.wikipedia.org/wiki/Trump_v._United_States",
    "published": "2026-02-07T21:11:54Z",
    "summary": "The Supreme Court ruled in 2024 that former presidents have absolute immunity for official acts within their core constitutional authority and at least presumptive immunity for other official acts. The case involved a federal prosecution of Trump for alleged election interference and the January 6 attack on the Capitol.",
    "source": "Web Search: Supreme Court ruling on presidential immunity",
    "category": "U.S."
  },
  {
    "title": "Read the full Supreme Court decision on Trump and ... - PBS",
    "link": "https://www.pbs.org/newshour/politics/read-the-full-supreme-court-decision-on-trump-and-presidential-immunity",
    "published": "2026-02-07T21:11:54Z",
    "summary": "Jul 1, 2024 · Presidents and former presidents have broad immunity from criminal prosecution for official acts they took while in office, the Supreme Court said in a 6-3 decision Monday.",
    "source": "Web Search: Supreme Court ruling on presidential immunity",
    "category": "U.S."
  },
  {
    "title": "Supreme Court ruling shatters his immunity defense",
    "link": "https://factually.co/fact-checks/justice/supreme-court-ruling-shatters-immunity-defense-a88dec",
    "published": "2026-02-07T21:11:54Z",
    "summary": "Jan 28, 2026 · Executive summary The Supreme Court ’s decision in Trump v. United States did not shatter a presidential immunity defense — it created one: the Court found that former presidents enjoy at least presumptive immunity for “official acts” and absolute immunity for a narrower core of those acts, a ruling that in practice strengthens immunity claims rather than destroys them [1] [2] [3 ...",
    "source": "Web Search: Supreme Court ruling on presidential immunity",
    "category": "U.S."
  },
  {
    "title": "The Supreme Court Immunity Ruling Now Complicating Trump's ...",
    "link": "https://govfacts.org/criminal-justice-public-safety/criminal-courts-legal-process/appeals-post-conviction/the-supreme-court-immunity-ruling-now-complicating-trumps-hush-money-case/",
    "published": "2026-02-07T21:11:54Z",
    "summary": "4 days ago · The Supreme Court ’s Immunity Ruling In July 2024, weeks after the conviction, the Supreme Court ruled in Trump v. United States that former presidents have broad immunity from criminal prosecution for actions taken in their official capacity. The 6-3 decision said presidents get absolute immunity for core constitutional powers—powers the Constitution specifically gives presidents, like ...",
    "source": "Web Search: Supreme Court ruling on presidential immunity",
    "category": "U.S."
  },
  {
    "title": "Presidential Immunity from Criminal Prosecution in Trump v ...",
    "link": "https://www.congress.gov/crs_external_products/LSB/PDF/LSB11194/LSB11194.1.pdf",
    "published": "2026-02-07T21:11:54Z",
    "summary": "Jul 5, 2024 · July 5, 2024 On July 1, the Supreme Court issued a divided 6-3 opinion in Trump v. United States addressing, for the first time, the existence and scope of a constitutionally based presidential immunity from criminal indictment and prosecution. The decision , which held that the Constitution provides former President Donald Trump with “some immunity ” from criminal liability for acts taken ...",
    "source": "Web Search: Supreme Court ruling on presidential immunity",
    "category": "U.S."
  },
  {
    "title": "Impact of Federal Reserve Interest Rate Changes - Investopedia How the Fed rate cut will affect your finances - CNBC What Makes the Federal Reserve Decide To Raise or Lower ... Top Stories How the Federal Reserve Makes Decisions That Shape Your ... The Fed Explained - Monetary Policy - Federal Reserve Board 6 key ways the Federal Reserve impacts your money The Fed Explained - Monetary Policy - Federal Reserve Board How the Fed rate cut will affect your finances The Fed cut interest rates. How quickly will you notice changes? What Fed interest rate cut means for auto loans, mortgage ...",
    "link": "https://www.investopedia.com/articles/investing/010616/impact-fed-interest-rate-hike.asp",
    "published": "2026-02-07T21:12:01Z",
    "summary": "Lower interest rates directly impact the bond market, as yields on everything from U.S. Treasurys to corporate bonds tend to fall, making them less attractive to new investors. Bond prices move inversely to interest rates, so as interest rates fall, the price of bonds rises. The effects on bonds depends on the type: 1. Government bonds: These are h... See full list on investopedia.com A Fed rate hike immediately fuels a jump in the prime rate , which the Fed calls the Bank Prime Loan Rate . This is the rate that banks extend to their most credit-worthy customers. This rate is the basis of other forms of consumer credit since a higher prime rate means that banks will increase fixed- and variable- rate borrowing costs when assessing ... See full list on investopedia.com Working off the prime rate , banks determine how creditworthy other individuals are based on their risk profile. Rates are affected for credit cards and other loans because both require extensive risk-profiling of consumers seeking credit to make purchases. Short-term borrowing will have higher rates than those considered long-term. Variable-ratecre... See full list on investopedia.com Money market and certificate of deposit (CD) rates increase because of the uptick of the prime rate . In theory, that should boost savings among consumers and businesses because they can generate a higher return on their savings. Meanwhile, those with debts would shift their funds to pay them off since those are likely climbing higher than the rates... See full list on investopedia.com A hike in interest rates boosts the borrowing costs for the U.S. government, fueling an increase in the national debtand increasing budget deficits. According to the Committee for a Responsible Federal Budget, the estimated total budget deficit from 2022 to 2031 will be $12.7 trillion. Increasing rates by just half a percentage point would increase... See full list on investopedia.com When interest rates rise, it's usually good news for banking sector profits since they can earn more money on the dollars that they loan out. But for the rest of the global business sector, a rate hike carves into profitability. That’s because the cost of capital required to expand goes higher. That could be terrible news for a market that is curre... See full list on investopedia.com Auto companies benefited immensely from the Fed ’s zero- interest - rate policy, but rising benchmarkrates will have an incremental impact . In theory, lower interest rates on auto loans should encourage car purchases, but these big-ticket items may not be as sensitive as more immediate needs borrowing on credit cards. See full list on investopedia.com A sign of a rate hike can send home borrowers rushing to close on a deal for a fixed loan rate on a new home. But mortgage rates traditionally fluctuate more in tandem with the yield of domestic 10-year Treasury notes, which are largely affected by interest rates. Therefore, if interest rates go down, mortgage rates will also go down. Lower mortgag... See full list on investopedia.com Higher interest rates and higher inflation typically cool demand in the housing sector. For example, on a 30-year loan at 4.65%, homebuyers can anticipate at least 60% in interest payments over the duration of their investment. But if interest rates fall, the same home for the same purchase price will result in lower monthly payments and less total... See full list on investopedia.com A rise in borrowing costs traditionally weighs on consumer spending. Both higher credit card rates and higher savings rates due to better bank rates provide fuel for a downturn in consumer impulse purchasing. When interest rates go down, consumers can buy on credit at a lower cost. This can be anything from credit card purchases to appliances purch... See full list on investopedia.com Oct 29, 2025 · The Federal Reserve lowered interest rates by 25 basis points on Wednesday. The central bank’s move will have a ripple effect on many of the borrowing and savings rates consumers see every day ... Jan 28, 2026 · When the Federal Reserve decides to raise or lower the federal funds rate , it makes headlines – and for good reason. Even small rate adjustments affect the cost and availability of credit, sending ripples through the country’s larger economy. But what exactly is the Federal Reserve , and why does it adjust rates in the first place? Read on for a full breakdown, including how the federal ... Dec 5, 2025 · The Federal Reserve controls the most powerful economic lever in America. When 12 people gather in a Washington boardroom eight times a year, their decisions ripple through every corner of the economy. ContentsInside the Fed’s Power StructureHow Interest Rate Changes Spread Through the EconomyThe Complex Reality of Policy LagsThe Fed’s Dashboard: The Data Driving the […] A change in the federal funds rate normally affects, and is accompanied by, changes in other interest rates and in financial conditions more broadly; those changes will then affect the spending decisions of households and businesses and thus have implications for economic activity, employment, and inflation. How does the Fed's interest rate decision affect borrowing costs? Put simply, the Fed’s interest rate decisions have a domino effect on almost all forms of borrowing. When rates fall (or rise), so, too, do borrowing costs on auto loans, credit cards, home equity lines of credit (HELOCs) and more. How does a change in federal funds rate affect the economy? A change in the federal funds rate normally affects, and is accompanied by, changes in other interest rates and in financial conditions more broadly; those changes will then affect the spending decisions of households and businesses and thus have implications for economic activity, employment, and inflation. How will a FED rate cut affect your finances? The Federal Reserve lowered interest rates by 25 basis points on Wednesday. The central bank’s move will have a ripple effect on many of the borrowing and savings rates consumers see every day. From credit cards and mortgage rates to auto loans and savings accounts, here’s a look at all of the ways a Fed rate cut could affect your finances. How will the Fed's key interest rate cut affect borrowers? How the Fed's key interest rate cut could impact borrowers. After a lengthy pause, the Federal Reserve on Sept. 17 announced a quarter percentage point cut to its benchmark interest rate . Economists say it is likely the first in a series of reductions that should make borrowing more accessible for consumers. Sep 18, 2025 · How the Federal Reserve 's decision to cut interest rates could impact U.S. borrowers.",
    "source": "Web Search: Federal Reserve interest rate decision impact",
    "category": "U.S."
  },
  {
    "title": "How the Fed rate cut will affect your finances - CNBC",
    "link": "https://www.cnbc.com/2025/10/29/fed-rate-cut-credit-cards-mortgages-savings.html",
    "published": "2026-02-07T21:12:01Z",
    "summary": "Oct 29, 2025 · The Federal Reserve lowered interest rates by 25 basis points on Wednesday. The central bank’s move will have a ripple effect on many of the borrowing and savings rates consumers see every day ...",
    "source": "Web Search: Federal Reserve interest rate decision impact",
    "category": "U.S."
  },
  {
    "title": "What Makes the Federal Reserve Decide To Raise or Lower ...",
    "link": "https://www.chase.com/personal/investments/learning-and-insights/article/fed-reserve-raise-lower-interest-rates",
    "published": "2026-02-07T21:12:01Z",
    "summary": "Jan 28, 2026 · When the Federal Reserve decides to raise or lower the federal funds rate , it makes headlines – and for good reason. Even small rate adjustments affect the cost and availability of credit, sending ripples through the country’s larger economy. But what exactly is the Federal Reserve , and why does it adjust rates in the first place? Read on for a full breakdown, including how the federal ...",
    "source": "Web Search: Federal Reserve interest rate decision impact",
    "category": "U.S."
  },
  {
    "title": "How the Federal Reserve Makes Decisions That Shape Your ...",
    "link": "https://govfacts.org/money/broader-economy/monetary-fiscal-policy/how-the-federal-reserve-makes-decisions-that-shape-your-financial-life/",
    "published": "2026-02-07T21:12:01Z",
    "summary": "Dec 5, 2025 · The Federal Reserve controls the most powerful economic lever in America. When 12 people gather in a Washington boardroom eight times a year, their decisions ripple through every corner of the economy. ContentsInside the Fed’s Power StructureHow Interest Rate Changes Spread Through the EconomyThe Complex Reality of Policy LagsThe Fed’s Dashboard: The Data Driving the […]",
    "source": "Web Search: Federal Reserve interest rate decision impact",
    "category": "U.S."
  },
  {
    "title": "The Fed Explained - Monetary Policy - Federal Reserve Board",
    "link": "https://www.federalreserve.gov/aboutthefed/fedexplained/monetary-policy.htm",
    "published": "2026-02-07T21:12:01Z",
    "summary": "A change in the federal funds rate normally affects, and is accompanied by, changes in other interest rates and in financial conditions more broadly; those changes will then affect the spending decisions of households and businesses and thus have implications for economic activity, employment, and inflation.",
    "source": "Web Search: Federal Reserve interest rate decision impact",
    "category": "U.S."
  },
  {
    "title": "California Fire Map, Update As Evacuation Orders Issued for ...",
    "link": "https://www.newsweek.com/california-fire-map-update-evacuation-orders-issued-gifford-blaze-2108974",
    "published": "2026-02-07T21:12:03Z",
    "summary": "Aug 5, 2025 · The Gifford Fire in central California has expanded to become one of the state's largest active wildfires , burning over 72,000 acres and prompting widespread evacuation orders .",
    "source": "Web Search: California wildfires evacuation orders update",
    "category": "U.S."
  },
  {
    "title": "California Wildfire: Latest Updates and Evacuation Orders",
    "link": "https://www.ecoflow.com/us/blog/california-wildfire-latest-updates",
    "published": "2026-02-07T21:12:03Z",
    "summary": "Jul 30, 2025 · California is battling intense wildfires , causing mass evacuations and significant damage. This article provides updates on major wildfires , evacuation orders , and community impact.",
    "source": "Web Search: California wildfires evacuation orders update",
    "category": "U.S."
  },
  {
    "title": "California Combined Statewide Evacuation Public View",
    "link": "https://www.arcgis.com/home/item.html?id=38ad47533c2f41e2a7b65d2934b47d6b",
    "published": "2026-02-07T21:12:03Z",
    "summary": "Feb 1, 2026 · CAL FIRE hosted feature service showing evacuation status levels for the state of California . Information provided in this layer comes from Genasys, Perimeter, county, and local emergency services team, including Fire , Police, and Community Managers. Data are updated every 15 minutes.",
    "source": "Web Search: California wildfires evacuation orders update",
    "category": "U.S."
  },
  {
    "title": "Map: See evacuation zones for major LA County wildfires Los Angeles wildfires: Some evacuations lifted as crews make ... Map: See evacuation zones for major LA County wildfires - NBC Los A… California Fire Map, Update As Evacuation Orders Issued for Gifford Incidents | CAL FIRE Incidents | CAL FIRE",
    "link": "https://www.nbclosangeles.com/news/california-wildfires/la-county-wildfires-evacuations-map/3599315/",
    "published": "2026-02-07T21:12:03Z",
    "summary": "Jan 9, 2025 · Map: See evacuation zones for major LA County wildfires Tens of thousands of people are under evacuation orders in Los Angeles County. Here's where. Jan 18, 2025 · Here are all the current wildfires burning in Southern California at a glance. Palisades Fire 23,713 acres 31% containment 10 deaths 5,316 structures burned Eaton Fire in San Gabriel Valley 14,117 ... What are the evacuation zones for fires in California? The map below shows evacuation zones for the following fires: Palisades Fire: Estimated at 17,200 acres in Pacific Palisades. Eaton Fire: Estimated at 10,600 acres in the Altadena area. Lidia Fire: Estimated at nearly 350 acres in the Antelope Valley community of Acton. Sunset Fire: Estimated at about 40 acres in the Hollywood Hills. How many evacuation orders were issued in San Luis Obispo county? Evacuation orders had been issued for nine zones in San Luis Obispo County and seven in Santa Barbara County, with the California Department of Forestry and Fire Protection (Cal Fire) warning of an immediate threat to life. A further 12 evacuation warnings in San Luis Obispo County and three in Santa Barbara County were also in effect. Do I need an evacuation plan if I live in a wildland area? If you live in a wildland area always have an evacuation plan in place . Fires occur throughout the State within CAL FIRE jurisdiction on a daily basis during fire season. However, the majority of those fires are contained quickly and no information will generally be provided on these incidents at this site if the fire burns less than 10 acres. When will California's fire threat go down? A significant rainfall event expected in late December or early January should reduce fire threat to near-normal levels starting in January. As of early October, 2025, 37% of California is experiencing drought with an additional 34% abnormally dry.",
    "source": "Web Search: California wildfires evacuation orders update",
    "category": "U.S."
  },
  {
    "title": "Los Angeles wildfires: Some evacuations lifted as crews make ...",
    "link": "https://abc7.com/live-updates/socal-braces-possibly-destructive-windstorm-amid-dangerous-fire-weather/15771235/",
    "published": "2026-02-07T21:12:03Z",
    "summary": "Jan 18, 2025 · Here are all the current wildfires burning in Southern California at a glance. Palisades Fire 23,713 acres 31% containment 10 deaths 5,316 structures burned Eaton Fire in San Gabriel Valley 14,117 ...",
    "source": "Web Search: California wildfires evacuation orders update",
    "category": "U.S."
  },
  {
    "title": "Nationwide opinion polling for the 2024 United States ...",
    "link": "https://en.wikipedia.org/wiki/Nationwide_opinion_polling_for_the_2024_United_States_presidential_election",
    "published": "2026-02-07T21:12:06Z",
    "summary": "This is a list of nationwide public opinion polls that were conducted relating to the general election for the 2024 United States presidential election . Those named in the polls were declared candidates or had received media speculation about their possible candidacy.",
    "source": "Web Search: 2024 presidential election polling trends",
    "category": "U.S."
  },
  {
    "title": "2024 Presidential Election Polls: Harris vs. Trump - 270toWin",
    "link": "https://www.270towin.com/2024-presidential-election-polls/",
    "published": "2026-02-07T21:12:06Z",
    "summary": "View the results of 2024 election polls . * The average includes the most recent poll from each source released within two weeks of the November 5 election . If there are fewer than five, the window is expanded to 30 days or five polls from the date of the most recent poll , whichever comes first. In the latter scenario, if there are multiple qualifying polls on the same calendar date as the ...",
    "source": "Web Search: 2024 presidential election polling trends",
    "category": "U.S."
  },
  {
    "title": "Latest 2024 Presidential General Election Polls ...",
    "link": "https://www.realclearpolling.com/elections/president/2024",
    "published": "2026-02-07T21:12:06Z",
    "summary": "Explore the latest 2024 Presidential General Election Polls with RealClearPolling. Explore trends and gain valuable insights for a comprehensive understanding of the political landscape.",
    "source": "Web Search: 2024 presidential election polling trends",
    "category": "U.S."
  },
  {
    "title": "How voting patterns changed in the 2024 election: A detailed ...",
    "link": "https://www.pewresearch.org/politics/2025/06/26/voting-patterns-in-the-2024-election/",
    "published": "2026-02-07T21:12:06Z",
    "summary": "Jun 26, 2025 · For the most part, voting patterns across demographic groups in the 2024 presidential election were not substantially different from the 2020 and 2016 elections . But Donald Trump’s gains among several key groups of voters proved decisive in his 2024 victory. To explore voting patterns among subgroups over time, refer to detailed tables.",
    "source": "Web Search: 2024 presidential election polling trends",
    "category": "U.S."
  },
  {
    "title": "2024 Presidential Election Polls: Harris vs. Trump The 2024 Election at a Precinct Level - VoteHub 2024 Presidential Election Predictions: U.S. Voter Trends",
    "link": "https://pro.morningconsult.com/trackers/2024-presidential-election-polling",
    "published": "2026-02-07T21:12:06Z",
    "summary": "Nov 3, 2024 · Tracking 2024 Presidential Vote Choice Over Time Share of voters who said they would vote for the following if the 2024 presidential election were held today: Data points reflect a three-day moving average of surveys conducted among at least 4,000 registered U.S. voters, with unweighted margins of +/-1 to 2 percentage points. Explore the 2024 U.S. Presidential Election results with our interactive precinct map. View vote margins, demographic breakdowns, and shifts from 2020 and 2016. Feb 12, 2025 · Explore Polling .com's study on 2024 presidential election predictions, including insights on voter shifts, turnout, and anticipated outcomes.",
    "source": "Web Search: 2024 presidential election polling trends",
    "category": "U.S."
  },
  {
    "title": "Infrastructure Investment and Jobs Act - Wikipedia",
    "link": "https://en.wikipedia.org/wiki/Infrastructure_Investment_and_Jobs_Act",
    "published": "2026-02-07T21:12:09Z",
    "summary": "The Infrastructure Investment and Jobs Act (IIJA), also known as the Bipartisan Infrastructure Law (BIL), (H.R. 3684) is a United States federal statute enacted by the 117th United States Congress and signed into law by President Joe Biden on November 15, 2021. It was introduced in the House as the INVEST in America Act and nicknamed the Bipartisan Infrastructure Bill . The act was initially a ...",
    "source": "Web Search: U.S. infrastructure bill implementation progress",
    "category": "U.S."
  },
  {
    "title": "Infrastructure Funding Progress Update Winter 2025",
    "link": "https://www.energy.gov/sites/default/files/2025-01/Winter+2025+Infrastructure+Progress+Report+(1).pdf",
    "published": "2026-02-07T21:12:09Z",
    "summary": "The U.S . Department of Energy’s (DOE) Office of the Under Secretary for Infrastructure serves as the demonstration and deployment arm of the Department, tasked with stewarding billions in historic investments from the Infrastructure Investment and Jobs Act (IIJA) and Inflation Reduction Act (IRA) to renew our nation’s infrastructure ...",
    "source": "Web Search: U.S. infrastructure bill implementation progress",
    "category": "U.S."
  },
  {
    "title": "At its two-year anniversary, the bipartisan infrastructure ...",
    "link": "https://www.brookings.edu/articles/at-its-two-year-anniversary-the-bipartisan-infrastructure-law-continues-to-rebuild-all-of-america/",
    "published": "2026-02-07T21:12:09Z",
    "summary": "Nov 15, 2023 · Whereas Congress typically passes separate bills for each infrastructure sector—or, in the case of broadband, no bills at all—the IIJA merged multiple built environment and natural environment ...",
    "source": "Web Search: U.S. infrastructure bill implementation progress",
    "category": "U.S."
  },
  {
    "title": "Bipartisan Infrastructure Law, Three Years Of Progress ...",
    "link": "https://www.doi.gov/sites/default/files/documents/2024-11/bipartisaninfrastructurelaw3yearprogressreviewnovember2024.pdf",
    "published": "2026-02-07T21:12:09Z",
    "summary": "Today, on the third anniversary of President Biden’s signing of the historic Bipartisan Infrastructure Law (BIL), I am deeply proud to say we have kept the President’s promise. This law—a once-in-a-generation investment in the Our Department received $28.1 billion from BIL across our Bureaus and Offices. Three years into BIL’s implementation , we have made rapid progress to deliver a ...",
    "source": "Web Search: U.S. infrastructure bill implementation progress",
    "category": "U.S."
  },
  {
    "title": "Infrastructure Investment and Jobs Act: - U.S. Government ...",
    "link": "https://www.gao.gov/products/gao-25-107166",
    "published": "2026-02-07T21:12:09Z",
    "summary": "Jul 24, 2025 · Enacted in 2021, the Infrastructure Investment and Jobs Act (IIJA) authorized and appropriated over $551 billion to the Department of Transportation (DOT) to provide grants to states, local governments, and other entities for transportation investments.",
    "source": "Web Search: U.S. infrastructure bill implementation progress",
    "category": "U.S."
  }
]